[{"title": "Trump SCOTUS nominee’s record on presidential investigations and abortion", "text": "Trump SCOTUS nominee’s record on presidential investigations and abortion copied!\n\nRon Klain says the Senate Judiciary Committee must ask Brett Kavanaugh if he gave the Trump White House any “assurances” about the Mueller investigation. Cecile Richards and Neera Tanden discuss what the nominee would mean to Roe v. Wade.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/the-last-word/watch/trump-scotus-nominee-s-record-on-presidential-investigations-and-abortion-1273509443689"}, {"title": "Senator Susan Collins on Supreme Court nominee Brett Kavanaugh", "text": "Senator Susan Collins on Supreme Court nominee Brett Kavanaugh copied!\n\nSenator Susan Collins (R-Maine) praises Supreme Court nominee Brett Kavanaugh as having, “impressive credentials and extensive experience.” Collins also comments on how Kavanaugh would handle challenges to the Roe v. Wade decision governing abortion.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/craig-melvin/watch/senator-susan-collins-on-supreme-court-nominee-brett-kavanaugh-1273911363831"}, {"title": "Raj Shah: Trump asked Kavanaugh broad questions, no hypotheticals", "text": "Raj Shah: Trump asked Kavanaugh broad questions, no hypotheticals copied!\n\nRaj Shah, White House Principle Deputy Press Secretary, reacts to concerns and questions over President Trump's Supreme Court nominee, Brett Kavanaugh: \"I’m going to let Justice Kennedy speak for himself. But the president's selection of Judge Kavanaugh was his own selection.\"\n\nRead More", "authors": [], "url": "http://www.msnbc.com/hallie-jackson/watch/raj-shah-trump-asked-kavanaugh-broad-questions-no-hypotheticals-1273838659787"}, {"title": "Trump: Putin Summit might be \"easiest of them all\"", "text": "Trump: Putin Summit might be \"easiest of them all\" copied!\n\nPrior to leaving US for the NATO summit, President Trump says his meeting with Vladimir Putin might the \"easiest of all.\"\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/trump-putin-summit-might-be-easiest-of-them-all-1273753667852"}, {"title": "Michael Flynn’s legal team asks for expedited sentencing schedule", "text": "Michael Flynn’s legal team asks for expedited sentencing schedule copied!\n\nFormer White House National Security Advisor Michael Flynn was DC District Court Tuesday morning, where his lawyers appealed to set a trial date. NBC’s Ken Dilanian reports.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/hallie-jackson/watch/michael-flynn-s-legal-team-asks-for-expedited-sentencing-schedule-1273826883647"}, {"title": "Federal judge extends deadline to reunite separated families", "text": "Federal judge extends deadline to reunite separated families copied!\n\nThe federal government will not meet today’s deadline to reunite the youngest migrant children who are separated from their families. Stephanie Ruhle and Ali Velshi speak with Gabe Gutierrez about parents who are stuck in agonizing limbo as the courts demand a new timeline to get these families back together.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/federal-judge-extends-deadline-to-reunite-separated-families-1273951299598"}, {"title": "Trump's job approval falls in latest poll", "text": "Trump's job approval falls in latest poll copied!\n\nThe president's job approval number stands at 41 percent, with 56 percent disapproving of his job, according to the latest Gallup weekly tracking poll. What's behind the numbers?\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/trump-s-job-approval-falls-in-latest-poll-1273664067898"}, {"title": "Schumer: Kavanaugh is far, far right on so many issues", "text": "Schumer: Kavanaugh is far, far right on so many issues 08:43", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/schumer-kavanaugh-is-far-far-right-on-so-many-issues-1273702467671"}, {"title": "Giuliani: Mueller probe most corrupt investigation I've ever seen", "text": "Giuliani: Mueller probe most corrupt investigation I've ever seen copied!\n\nAfter staying out of the limelight, Trump attorney Rudy Giuliani is back on TV with a new set of answers about whether Trump will agree to an interview with Mueller. Michael Schmidt & Mimi Rocah discuss.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/giuliani-mueller-probe-most-corrupt-investigation-i-ve-ever-seen-1273514563730"}, {"title": "Cave rescue operation ends as all trapped Thai boys are freed", "text": "Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n\nCHIANG RAI, Thailand — After 17 long nights trapped in a dark and damp cave, four remaining boys and their soccer coach were freed one-by-one by divers in Thailand on Tuesday.\n\nRescuers started the day hoping to help the final five who had been stranded for more than two weeks reach the surface and safety. The first of the group emerged Tuesday afternoon local time with the others following soon after, ending an eight hour and 10 minute operation.\n\n\"We are not sure if this is a miracle, a science, or what. All the 13 Wild Boars are now out of the cave,\" the Thai navy SEALs posted on Facebook, referring to the name of the boys' team.\n\nThe medical condition of the boys rescued Tuesday was not immediately known. Officials previously said that the healthiest boys would be brought out first.\n\nThai Navy SEALs also returned safely. Thai Navy\n\nThe complicated operation started Sunday when expert divers rescued the first four boys. They then went back in on Monday and retrieved four more.\n\nWith experience under their belts, Tuesday's operation was completed hours faster than before.\n\nA medic and Thai navy SEALs who had stayed deep inside the mountain since the 13 missing males were found on July 2 also needed to navigate the narrow, water-logged passages in the cave complex. All successfully returned to the surface Tuesday.\n\n\"We have finished successfully something that nobody thought could be done,\" Chiang Rai Gov. Narongsak Osottanakorn told a news conference Tuesday after the operation was completed.\n\nThe boys vanished on June 23 with their 25-year-old coach after seasonal rains flooded the caverns and narrow passages, blocking their exit from the popular tourist destination. Nine days later, two expert cave divers found the trapped group.", "authors": [], "url": "https://www.nbcnews.com/news/world/thai-cave-rescue-operation-underway-rescue-final-5-trapped-n890106"}, {"title": "Why Is This Happening? How prosecutors can help end mass incarceration, with Larry Krasner: podcast & transcript", "text": "Get the Think newsletter.\n\nHave you heard about Larry Krasner? He’s a lefty progressive lawyer in Philadelphia that made his name by defending the underdogs, representing activists and suing police officers. Last year, he was elected as Philadelphia’s District Attorney, meaning he now runs the mass incarceration machine he’s spent his decades-long career criticizing. He might be the last person in the world you would expect to be the chief prosecutor for the city of Philadelphia, but if you truly want to see criminal justice reform what better place to start?\n\nPeople looking at the growth of mass incarceration are increasingly focusing on the key role that prosecutors play, and in just six months Krasner has already radically changed that role. Chris Hayes got a chance to talk to Larry Krasner about “storming the palace doors:\"\n\nCHRIS HAYES: For people that are not in Philadelphia, I remember being down in Philadelphia and someone telling me about you. It was like, \"Get a load of this. Check out this story. The guy that comes to collect the anarchists when they get arrested outside City Hall and sues the cops, he's gonna run for prosecutor.\" Not as a joke, but just as a wild story that obviously this individual will not be the next district attorney of Philadelphia, but it's interesting that someone with that background would run. How did you go from there to winning?\n\nLARRY KRASNER: I can't blame people for finding my candidacy hilarious or unlikely. It was both of those things. But it was both of those things if you think that the mainstream Democratic party still has the answers, which they clearly do not. The only answers that they seem to have are how to lose elections while someone as brilliant and magnetic as Barack Obama can still win.\n\nCHRIS HAYES: Hello and welcome to \"Why Is This Happening\" with me, your host, Chris Hayes.\n\nThis episode of the podcast is really two stories in one. There's a policy story, and it's a policy story about mass incarceration and criminal justice. Then there's a dramatic story. A kind of mythic story. The mythic story is a story about what happens when the revolution seizes the palace. What happens when the rebels take the capital, when they actually storm the halls of power and throw out the old regime, and sit in the throne room, and start making the rules.\n\nThe policy story. The policy story is about our country, which is the most incarcerated country in the world, per capita. There is a few small islands, with a very small number of people that are more incarcerated, but basically the most incarcerated country in the entire world. For years, people have been talking about and critiquing this phenomenon we call mass incarceration, the sheer number of people that we put in prison, and then the even larger population of people that are under what we call penal supervision. Those are people that are on probation, or on parole. Huge, huge, huge numbers of people cycling through the criminal justice system.\n\nThere's been a debate for a long time for what the cause of the growth of mass incarceration was. In recent years, thanks to some really interesting scholarship, a lot of folks in the criminal justice world have started to focus on one key part of the system. It's not law makers and state capitals passing laws, although they have a huge effect. It's not beat cops making arrests, although they have a huge effect. The fulcrum that has been identified by a lot of the folks who are trying to reduce mass incarceration and remake American justice is the prosecutor.\n\nIt turns out, when you look at the data, when you study how it is that we have arrived at the prison population we have, a huge amount of what's driving it are prosecutors. That's because prosecutors have enormous discretion in the American system to not charge people for crimes, or to charge people for crimes. To charge someone for one misdemeanor, or to charge someone for three misdemeanors, or to charge someone for two misdemeanors and a felony, or to charge someone for a Class A felony rather than a Class C felony, to throw the book at people. That discretion is in an office that is often remarkably unaccountable.\n\nDAs in this country, district attorneys, prosecutors, tend to be elected. They tend to be elected in very low turnout elections. They tend to be elected on campaigns that entirely trade on and traffic in the worst kind of fear mongering about the scourge of crime. They tend to run exclusively on platforms that they're gonna be the toughest, they're gonna throw the book the most. Then they create offices that have a culture of doing that.\n\nThere's been this theory that's developed, among a whole bunch of critics of the system, that really if you want to reform the criminal justice system in America, one of the most powerful places you can do it is in the prosecutor's office. Here's where we come to the story about the rebels taking the palace. How do you get elected a prosecutor if you're the kind of person who wants to reform what it is the prosecutors do. Because the game is rigged. The deck is stacked. The entire way that for years, that these campaigns have been run is who is gonna be the toughest, who is gonna throw the book at the most people, who is gonna throw the most people in jail, who is gonna save you from the scary figures? How do you win an election if you don't want to do that?\n\nWell, in the last few years, a number of reform prosecutors have run races and won, in some places, in which their agenda and their campaign platform has been explicitly about rejecting a lot of the basic frameworks that have driven prosecutors for years. They've run an agenda of reforming prosecutor's office, of not throwing a book at everyone, at offering people ways of diverting out of the criminal justice system, of not prosecuting every low level drug offense.\n\nPhiladelphia District Attorney Larry Krasner. Matt Rourke / AP file\n\nThe biggest city in America, in which a candidate like that has run for office and won is Philadelphia. In Philadelphia, there's a guy named Larry Krasner who is currently the District Attorney of Philadelphia. Larry Krasner is a fascinating dude because Larry Krasner is the last person in the world you would think would be the prosecutor of one of the biggest cities in America, because Larry Krasner is a lefty lawyer, lifelong defense attorney, who is the kind of guy who shows up on the evening news because he's the lawyer for the anarchists that got arrested protesting. That's who Larry Krasner is.\n\nNow Larry Krasner, who is a true believer in criminal justice reform and deconstructing the machinery of mass incarceration, sits atop the office that produces incarceration in one of the biggest cities in America. He is the rebel who has taken the palace and he now sits there at the desk, making the decisions that the people he spent his life battling against and critiquing used to make, and now he has to be the one to implement his vision of what a more just and humane system looks like while also being the person that prosecutes crimes that takes alleged rapists and alleged murderers, and puts them behind bars that finds people who are accused of violently accosting fellow citizens and decides how much to charge them, how long they need to be kept away from society. He now has that power and that control.\n\nFor this reason, for both the policy reason, which is close to my heart. I wrote a book called \"A Colony in a Nation,\" which is about criminal justice and the system that we have created. For this dramatic reason, as I think about the iconic nature of this mythic story that's unfolding in Philadelphia in front of our eyes, I wanted to talk to Larry Krasner for a long time.\n\nEarlier in the summer, we did a town hall on a race in Philadelphia. It was petting to the Starbucks incident and Starbucks day of training, and Larry Krasner was a guest, and I got to talking with him, and invited him on the podcast. Larry Krasner came on the show. The thing that you will see is that he does not talk like a politician. He is not carefully poll tested and watching what he says. He is a true believer in the mission of what he is trying to accomplish. It is absolutely fascinating to hear what he's doing.\n\nWhat's new in the great city of Philadelphia?\n\nLARRY KRASNER: Oh. All kinds of things. We have our rebellious football team which is thrilling for me. We also have a Super Bowl winning team, which is unheard of for Philly, and that's great.\n\nCHRIS HAYES: How old are you Larry?\n\nLARRY KRASNER: 57.\n\nCHRIS HAYES: 57. I want to start really early. Where did you grow up? Where did you go to school? Where did you go to high school?\n\nLARRY KRASNER: Born in St. Louis. I went to public school in St. Louis and then my dad moved out to the east coast. He was a writer, and an author, and journalist, and all that good stuff.\n\nCHRIS HAYES: Really?\n\nLARRY KRASNER: Yeah. He got a job out on the east coast. We came out here. I went to public schools in the Philly area. I went to college in Chicago. Came back to Philly, worked as a carpenter for a year. Served on a death penalty jury in the area. Then I went to law school in California and came back to Philly to be a public defender.\n\nCHRIS HAYES: Was there a relationship between serving on a death penalty jury and going to law school?\n\nLARRY KRASNER: Well, yes. I had been thinking about it, been thinking about a couple things including, strangely enough, divinity school, and also...\n\nCHRIS HAYES: Divinity school?\n\nLARRY KRASNER: Yeah, and also possibly being a language professor. But I settled on law school A) because my brother said I liked to argue all the time, and B) because the experience of being on a death penalty jury was pretty compelling.\n\nCHRIS HAYES: What about it?\n\nLARRY KRASNER: Well. This was the first death penalty jury in the county, since the U.S. Supreme Court's moratorium. It was a horrifying case involving a rape/murder of an elderly woman by a guy who basically was a handy man. The involvement of the FBI was very extensive because the woman who was killed was the mother of an FBI agent. The evidence in the case was overwhelming, the publicity was very high, it was a crime in which the victim was white and the defendant was black.\n\nThere's a lot of racism involved in the jury's deliberations. We were a sequestered jury, so we were living in a hotel because the publicity was so high. It was just a very vivid and compelling experience. What made it even stranger is one of our jurors was so mentally ill, that he was removed from deliberations after they began. That occurred essentially because we were sequestered, and he was untruthful about his need for medication. About a week in, he started to disassociate, and stood up in the deliberations and said that he could not sit in judgment on another person.\n\nThe case followed through with a verdict from 11 instead of 12. But even though it was a verdict in the first-degree, it did not go to a death phase because the deal that had been cut, unknown to the jury, was that there would be no death phase in the event that 11 jurors gave the verdict.\n\nCHRIS HAYES: Meaning that the deal was cut, that they go to the lawyers and they say, \"We got a problem. We got a guy we got to take out there because he is disassociating.\" The deal was, rather than declare a mistrial or put in an alternate, that if they reach a guilty verdict of murder in the first with 11, then they won't try for the death penalty.\n\nLARRY KRASNER: Correct. It was about the only thing the defense attorney did well with a difficult case. But unbeknownst to us when we came back with a first-degree verdict, there was no death penalty.\n\nCHRIS HAYES: So wait a second, you Larry Krasner, the great hope of the criminal justice reformers, the nation over, the experiment that is happening in Philadelphia of a new way of conceiving the application for criminal justice, your first professional or adult experience of the law was voting to convict a man on first-degree murder, knowing he might get the death penalty.\n\nLARRY KRASNER: Correct.\n\nCHRIS HAYES: What were your politics like back then when you were sitting in that jury room?\n\nLARRY KRASNER: Very progressive. Very liberal. But my obligation as a juror was to speak the truth. The truth was pretty clear. We had her blood, his fingerprint in her blood, that fingerprint on the mirror of her car, which was outside of the hotel room where he was hiding. We had a whole lot of other stuff too, including the house burned down, on top of her, and connections.\n\nThere was no question about guilt. There was no question about the rape. There was no question about the murder itself. In my mind, there was not question that it was first-degree, which is what juries are supposed to do. That wasn't an issue. The death phase of course, is a totally separate proceeding. What would have happened, I guess we can't really say because we never had that deliberation.\n\nCHRIS HAYES: How old were you?\n\nLARRY KRASNER: I was 23.\n\nCHRIS HAYES: Geez Louise. That's really young.\n\nLARRY KRASNER: It was. They never would have put me on the jury, except I was working as a carpenter. They didn't ask what else I might be doing. They did not know I had law school applications underway. But that was it.\n\nCHRIS HAYES: Wow. So you're a 23-year-old carpenter. I mean, I guess, can you remember where your head was at as you were doing this? Deliberating and thinking about what this meant?\n\nLARRY KRASNER: Yes. I actually have pretty vivid memories of a lot of it. I have memories of one of the jurors.\n\nNow this is Pennsylvania, which does have a lot of conservative rural folks. But most of us are more like east coasters in our mentality. I remember going in the back and the first thing out of the mouth of the guy with the cowboy boots and the big belt buckle was, \"We have to get this boy.\" Needless to say, he was referring the black defendant.\n\nI remember a number of other comments that I interpreted as being racists. When a few of us disagreed with some of the other jurors, we would have our own races or ethnicities called into question. It was an example, in my mind, of what's good about juries, which is that they're a super brain of people who have specific knowledge and interests coming together. But it also lets in the door of people who have some pretty nasty attitudes and are willing to vent them in bad ways.\n\nCHRIS HAYES: You go to law... Where did you go to law school?\n\nLARRY KRASNER: Stanford Law School.\n\nCHRIS HAYES: Do you come out of law school thinking, \"I'm gonna be a lefty crusading lawyer?\" What's the game plan there?\n\nLARRY KRASNER: I came out of law school knowing I wanted to do criminal law. I wanted to be a trial lawyer. I interviewed with a lot of prosecutor's offices, and a lot of defender's offices around the country, and had several different opportunities. I really wanted to be a trial lawyer and do criminal justice, but I did not think either side really had all of the truth. I thought both sides had potential. What I found when I interviewed is usually I was a lot more comfortable with the defense attorneys. Not always. But usually, more comfortable with them than the prosecutors.\n\nCHRIS HAYES: There's a funny that happened. My wife is a lawyer and we were together while she was in law school. You went to Stanford. That's obviously an extremely good law school. It's very prestigious. It's the top of the heap. There's this really weird and interesting prestige thing that happens where prosecutor jobs are extremely high prestige in a way that defense attorney jobs are not. Was it like that back then?\n\nLARRY KRASNER: It was. More than anything in law school, the prestige jobs were the ones for big corporate firms that pay tons of money. Which is not really what I wanted to do, and frankly not what I think my skillset is. But yes, in general the view has been that public defender jobs are for floppy hippies. U.S. attorneys jobs, well they're federal, so they must be more important than state court, even though the truth is the vast majority of criminal cases happen in state court. There is that snob-ism and that sort of notion that being a prosecutor is more important or better among many people.\n\nCHRIS HAYES: What is the thing that makes one the high status, high prestige job? Is it just power?\n\nLARRY KRASNER: I think the answer is yes. I also think there are different groups. There are a lot of people who would never consider being a prosecutor and they view the public defender service in Washington D.C. as being the greatest office in the world, and it's a truly great office that attract incredible talent. There are these groups of people who wouldn't consider the other side. But most people who go to law school are fairly conventional, to be honest. In their world, power, and government, and being on the side of the corporation feels like the safe thing, feels like the prosperous thing. They're not wrong about that. I think, in general, among most law students, the prestige lies on the side of government and corporations.\n\nCHRIS HAYES: Tell me a little bit about your legal practice before you decided to run for this position. What kind of lawyering did you do?\n\nLARRY KRASNER: I became a county public defender in Philly which I loved, for three years. I became a federal public defender in Philly, which I did not love, for two years. Then I became a private attorney doing civil rights and criminal defense. I was in criminal court about four or five days a week, for essentially the next 25 years, so 30 years of being in court. Very heavy trial practice, a lot of jury trials, tens of thousands of clients, and frankly I found it fascinating.\n\nI tended to focus on things other people didn't. For example, I did a lot of pro bono representation of activists. This goes all the way back to Act Up in Philly. Partly I think it was just the air that I was breathing in the 1960s, when I was watching the civil rights movement, and I found that fascinating.\n\nBut I ended up early on knowing people in Act Up well, at a time when this was truly a national crisis and representing them in various different capacities, but mostly in terms of defending them when they would get arrested and mistreated by the local prosecutor. That became Occupy, it became Black Lives Matter, it became Grannies for Peace, and it became all of these different activist groups for 25 years, whose cases I did, mostly pro bono. Then every now and then, we would do civil rights lawsuits on their behalf, if they were truly mistreated. But I also did about 75 or more lawsuits against Philadelphia Police Department for corruption, for brutality, for violations of civil rights because in truth there was no enforcement against police in Philadelphia. There was really no accountability, and I found that unacceptable.\n\nCHRIS HAYES: You sued the cops?\n\nLARRY KRASNER: Yup.\n\nCHRIS HAYES: A lot.\n\nLARRY KRASNER: Yup.\n\nCHRIS HAYES: You sue the cops. You defended people accused of crimes. I feel like every city has this, the lawyers that show up after the bunch of people get arrested who were protesters. That's who you are in Philadelphia, basically.\n\nLARRY KRANSER: I'm one of them. There are a few of us, but we're a proud and generally broke few.\n\nCHRIS HAYES: I guess what are your values that are motivating you to do that kind of work over the three decades you're doing it?\n\nLARRY KRASNER: Well, first of all I'm oppositional. Going against power is comfortable for me. I'm a big fan of the underdog, as are the Philadelphia Eagles, I want to stress that point.\n\nCHRIS HAYES: The only thing that sounds like a politician about you so far is the praise of the Eagles, which I'm sure is genuine also, but it's the only thing that comes anywhere near close to pandering in what you said thus far.\n\nLARRY KRASNER: I'm willing to pander for my Philadelphia Eagles. I would like to point out...\n\nCHRIS HAYES: Okay, you've it in three references. What would you like to point out?\n\nLARRY KRASNER: I like to point out that Malcolm Jenkins and Chris Long, and a few other people have been national leaders on criminal justice reform and...\n\nCHRIS HAYES: They have been.\n\nLARRY KRASNER: ...despite the fact that they were beating everybody else on the football field, so that's pretty good.\n\nCHRIS HAYES: Yeah, that's true. So, what about your values, like why'd you do this work?\n\nLARRY KRASNER: You know, I was trying to get away from that question. What about my values. I mean, honestly, there is a part of me that really likes to fight for the underdog, and there's a part of me that is not trusting of government, as I think an awful lot of people are not. I just think that there should be equality, there should be fairness, there should be even handedness. Poor people should not be picked on, and people should not be picked on because they are disabled, or because they are gay, or because they are black. That ain't fair. We shouldn't do that, that's not what this country’s about.\n\nCHRIS HAYES: It's rewarding work in a lot of ways but it can be a really, it's hard work, and it's a grind. There's a sense of this sort of bureaucratic grayness to the whole thing as the sort of machinery of mass incarceration just kind of grinds through these massive populations. Did you feel frustrated or unsettled by what you were seeing over this career in these criminal courts?\n\nLARRY KRASNER: I did. I wouldn't want to underestimate the kind of just joy that goes with the picaresque tale that is being in court, and seeing these criminal cases. There's a lot of tragedy and it frankly can be somewhat traumatizing for the police, and certainly for the families of victims, and also somewhat secondarily traumatizing to EMTs and doctors and even lawyers, who have to look at these horrifying photos and contemplate these terrible things.\n\nBut, make no mistake, it's really fun. It's very entertaining. I mean, there is a reason why people go home to watch shows about what goes on in criminal court. It's pretty entertaining stuff. I certainly felt that side of this.\n\nOn the other hand, what I was seeing at the sort of global level was a slow motion car crash that went on and on for 30 years, and the twin evils of mass incarceration and mass supervision getting worse and worse and worse. As Philadelphia was not getting richer and was not getting safer by national standards.\n\nI was kind of looking at my life's work and realizing that my life's work, while it may have been entertaining and I may have done a lot of justice for individuals, and maybe I helped create a space where free speech and non-violent social change were possible, my life's work wasn't really going to measure up compared to the gray things that had been to whole populations of people that were holding society back and I found that pretty frustrating.\n\nCHRIS HAYES: So, you decide to run to be the chief prosecutor of Philadelphia.\n\nLARRY KRASNER: This is correct.\n\nCHRIS HAYES: Okay. How does that decision happen?\n\nLARRY KRASNER: I was watching another election, I was about 56 years of age, and I knew everybody who was running. It was a pretty unstable situation because the prosecutor, Seth Williams, was not under indictment but he was under federal investigation and that's why so many people were getting in the race.\n\nAnd as I watched the candidates, they were all ex-prosecutors of one type or another and they really did not represent anything that looked like change. Not even, frankly, mild change. It was a whole lot of chest beating and foot stomping about how we need to be tough on crime and put more people in jail, with almost no specifics. I thought there was another person who might have run, and if so I would not have run, but she didn't. So, eventually, I sort of cast around a little bit wondering if I had a shot, because in fact I had a good law practice and I was enjoying myself in many ways, and I didn't want to do this for nothing.\n\nIt looked like I had more support than expected, mostly coming from all these activists who I had represented previously who were, it seemed like they were willing to give back. So, once I realized there was some change that this highly unlikely thing might happen that's when I jumped in.\n\nCHRIS HAYES: Yeah, I mean I just want to, for people that are not in Philadelphia, like I remember being down in Philadelphia and someone telling me about you. It was like, \"Get a load of this, check out this story, like the guy that comes to collect the anarchists when they get arrested outside city hall and sues the cops, he's going to run for prosecutor.\"\n\nNot as a joke, but just as like a wild story that obviously this individual will not be the next district attorney of Philadelphia, but it's kind of interesting that someone with that background would run. How did you go from there to winning?\n\nLARRY KRASNER: Well, you know, I think the simple answer is that every challenge is an opportunity and the voters were nowhere near on the same page with the political elite, and they were nowhere near on the same page with the criminal justice system as we have it. One of the more amusing things that I saw is we're going around, we're doing these forums. There's like seven different candidates for DA and they're almost all men, they're almost all white. They got glasses. A couple of them got a last name starting with a K, right?\n\nWe're in neighborhoods, Philly D and Philly, we're in neighborhoods that are overwhelming black. Every other candidate is trying to pound me because I haven't been a prosecutor, and I am proudly proclaiming, \"I haven't been a prosecutor, I haven't been part of the problem.\" I would see all these older women open their purses and pull out a three by five card and a pen, and they were writing down my name. That was what none of these candidates got.\n\nCHRIS HAYES: \"I got to remember which one it is, which.\"\n\nLARRY KRASNER: Right. \"Oh, it's, that's the one who was not the prosecutor.\"\n\nCHRIS HAYES: That's the guy. Well, I mean, that actually, I mean the math here is interesting too just hearing you spell it out. Right, like if you've got a crowded field of seven people, because you're in a primary. You've got a crowded field of seven people, six of them ex-prosecutors, and there's one guy who's not, that probably helps distinguish you, too.\n\nLARRY KRASNER: It does distinguish you. Of course, being distinguished can take you two different directions, but it does distinguish you. I can't blame people for finding my candidacy hilarious or unlikely, it was both of those things, but it was both of those things if you think that the mainstream Democratic party still has the answers, which they clearly do not. The only answers that they seem to have are how to lose elections while someone as brilliant and magnetic as Barack Obama can still win.\n\nCHRIS HAYES: Right.\n\nLARRY KRASNER: I think what the voters were clearly looking for was a reason to vote. That's part of the story here is that we saw this massive group of people who were either millennials or they were African Americans, especially older women. Or, in some cases, they were working class whites who had been canvassed in their homes by people who went there. Those are the people who came out in highly unexpected numbers. The increase in the total number of votes in this off-year election cycle was huge. It went from three consecutive cycles of about 120,000 total votes, to 170,000 total votes.\n\nCHRIS HAYES: Wow.\n\nLARRY KRASNER: Some of that's probably Trump, but the consequence was we won the primary in a landslide. Strangely enough in the general election in a city that's overwhelming Democratic and with no outside money in the general, because there was outside money in the primary, the margin got even bigger. There was just this explosion of people. I mean, you were making jokes about anarchists before, right? Well, generally they don't vote, except they voted this time. There were-\n\nCHRIS HAYES: Ah yes, the secret weapon, getting anarchists to vote.\n\nLARRY KRASNER: There you go, there you go. I mean, there is a reason that Bernie Sanders took the Democratic vote among young people in basically every state. The reason is that people are tired of mainstream politicians. They are looking for a reason to vote and if you actually give them a reason they'll do it. Both parties have been busily suppressing the total number of voters for decades, and when an outlier candidate who represents something different comes around, you're going to get people who wouldn't vote to vote.\n\nCHRIS HAYES: I've often thought, in Europe they don't elect prosecutors and they think it's crazy we do. Politicians whipping voters into a frenzy over crime and the fear of crime, and it's something I've seen first hand living through New York when there were 2,300 murders a year. Then, getting voted, you know, rewarded by voters for that fear whipping, that was a real small d Democratic dynamic that drove crime policy in a lot of places. I wonder why, you think, why did that not hold in your case?\n\nLARRY KRASNER: Maybe because it held so many times in the past? You know, when you get to the point where one in three black men is going to experience jail in their lifetime you have come to a moment. It's a moment not just for them, it's a moment for their sisters and their mothers who are watching the consequences of a young person who does something not so bad getting a felony and therefore being effectively unemployable the rest of their life.\n\nPrisoners from Sacramento County await processing after arriving at the Deuel Vocational Institution in Tracy, Calif in February 2014. Rich Pedroncelli / AP, file\n\nIt's, I mean, I think a lot of it is just that the experience of people who are poor, and the experience of people who are of color and are therefore incarcerated at much, much higher rates in the most incarcerated country in the world, goes one way and the experience of affluent, professional white people, like me to be honest, goes a very different way, because they're getting their information about criminal justice from some sort of elite publication that, like it or not, is still in the fear business and still in the yellow journalistic tradition of blood and guts sell papers.\n\nWell, blood and guts also sell votes, and that's been going on for a very, very long time. But, at some point you're so incarcerated that there's nobody walking down the street. At some point you have no economy whatsoever because the gross national product is all in prisons. We're not that far from that point, we really aren't, and that's part of the reason that we see the right in many ways agreeing with the left when it comes to the necessity of ending mass incarceration and mass supervision.\n\nCHRIS HAYES: Well, certain parts of the right, I wouldn't get too...\n\nLARRY KRASNER: Oh, I agree, that's right.\n\nCHRIS HAYES: But, you touched a little on the racial dynamics here, I mean one of the things that ... there's this great book by James Foreman that won the Pulitzer actually, called \"Locking Up Our Own,\" which is about sort of the politics of crime in urban centers. Particularly in the 1980s and '90s and the rise of mass incarceration particularly among black voters, and the complicated story there was about that. I wonder how you... because the prosecutor that came before you, Seth Williams, was African American. You're a white guy sort of running against the system in a city with a very large population of people who are not white. What were those dynamics like?\n\nLARRY KRASNER: Well, you know, it's kind of a fascinating thing to experience, because I guess you get sort of jaded as someone who's an outsider to politics in assuming that all black people are going to vote for a black person and all white people will vote for a white person. Basically, the people who voted for me were either much younger than me, women, or of color, or all three. I mean, that's what it was. The ones I could never reach look like me.\n\nCHRIS HAYES: Right, right.\n\nLARRY KRASNER: So, in their eyes it wasn't identity politics and you're absolutely right. What Foreman's writing about is true, it is not the case that just because you elect a black person, that person will necessarily be progressive. This has a lot more to do I think with individual values and individual character. I'm not saying that to toot my own horn, I'm just saying that stereotypes are bad. They're bad when we apply them to whole categories of people and say they're dangerous and they belong in jail. They're bad when we apply them to whole categories of people and say they're poor because they're lazy.\n\nBut, it's also bad when you say, well, every white politician is going to screw people who are of color. It's just not true. It's also not true to say every police officer is bad, or every police officer loves illegal stop and frisk. There's a ton of police officers who happen to African American, and women, and young. So, this sort of monolithic stereotypical approach to evaluating these things turns out to be incorrect. It seems to be to much more about the life experience and the values and the connection than it is about anything else.\n\nCHRIS HAYES: You win the primary, which everyone sort of assumes like whoever wins the primary is going to win the general, it's Philadelphia. But then, if I'm not mistaken, like the police union just flips out when you win the primary, right?\n\nLARRY KRASNER: They flipped out before I won the primary, but yeah.\n\nCHRIS HAYES: Yeah, I mean, well, they flipped out before you win the primary, but what was the police unions stance on the candidacy of Larry Krasner?\n\nLARRY KRASNER: Well, in the words of the president of the police union when he heard that I announced, he said it was, \"Hilarious.\" Now, there's a reason he said that.\n\nCHRIS HAYES: Well, I had a sort of a similar response, I really can't fault him for that.\n\nLARRY KRASNER: Well, I'm not saying he's wrong, but at any rate there's a reason for that, which is that unlike New York, Philadelphia has a monolithic police union that is the bargaining agent. It is dominated by its white membership, and frankly to some extent by its retired membership. The guy who's in charge of it happens to be someone I was deposing 20 years ago in a police corruption law suit, because he was awful close to a bunch of narcotics cops who, I won't go on and on, but they invented an informant and they stole a whole lot of stuff and they framed a lot of people. So, I mean, it is what it is.\n\nCHRIS HAYES: Oh, so he wasn't enthusiastic about your candidacy?\n\nLARRY KRASNER: I know that's hard to believe. I know that's hard to believe, but I mean let's be honest, the job of a union head to some extent is to avoid accountability on the part of its members. This is a union head who takes that to an extreme. I think he had a personal affinity frankly for people who didn't want to be accountable, and that's kind of how it's operated.\n\nPhilly has a long tradition going back to a police officer who became the police chief who became the mayor, named Frank Rizzo, of police chiefs yelling into the ear of the mayor of the sound coming out of the mayor’s mouth. They have been a political stronghold in Philly even more so than in other cities. A lot of that has to do with what you were talking about, is that district attorneys use fear not just to become the district attorney, but they use it to become U.S. senators and they use it to become governor. And, in a state like Pennsylvania where running state wide means you want the fraternal order of police state wide to support you.\n\nThat means if you're in Philly it's crucial that you do whatever the FOP wants, and that's how things have worked in Philly for my whole career. Until now, because frankly I don't want to run for anything else. I'm pretty happy being the DA in Philadelphia county and I am much more concerned about even handedness and lifting up the good police officers than I am protecting the bad ones.\n\nCHRIS HAYES: So, here you've got like the critic of the system, someone who has never been a prosecutor, lifelong defense attorney, made his bones suing cops. Now you, Larry Krasner, are going to run the machinery of mass incarceration in Philadelphia. What has that experience been like? I mean, the institutional gravity of a place that is down to every last bureaucratic detail been working one direction for a very long time, and you're going to come in at the top and try to reverse it.\n\nLARRY KRASNER: I mean, for me it's been fascinating and wonderful. We have approached this as you might approach life if you are facing cancer. There is a fierce urgency of now, and we have to seize it. I genuinely view this as a movement and you have to act like a movement if you're a movement. That means you need to come in and you need to change things, and you need to do so quickly. We do not have time to move the way government moves, which is slowly and ineffectively and in compromised ways.\n\nSo, we did what was necessary, which is that we came in, we identified a very small portion of the personnel who did not share the mission and never would, and we asked them to resign and they did. It was only about five percent, but they went out the door. We have been steadily bringing in new prosecutors who have a different moral compass, frankly, and who are talented and hard working and who share the vision. That is, to me, it is that swap of personnel. It is the years we're going to dedicate to recruiting the right kind of people that really will be our legacy.\n\nCHRIS HAYES: But, I don't buy how frictionless you just made that sound.\n\nLARRY KRASNER: Oh, there was friction, make no mistake. I mean, so what —\n\nCHRIS HAYES: Well, that's what I want to hear about. I mean, it's just like, \"Well, we came in and it was, they left, and you know, now it's…\n\nLARRY KRASNER: Well, look, I mean the friction comes at many levels. First of all, when the pirates take over the ship some people got to go over the side or the ship will be sailed in the wrong direction. So, we are the pirates, we did take over the ship, and some people went over the side and now we're headed the right direction. Needless to say, when you start that process —\n\nCHRIS HAYES: I'm sure the police union loves that.\n\nLARRY KRASNER: Well, you know, I'll tell you, the African American Police Officers Association, which is about 30 percent or so of the police department, endorsed me in the general election. Once again, no, the head of the police union did not, but there are many police officers of good will who are actually very much on board with getting their corrupt colleagues out of the way so that they can get promoted and they can get advanced and they can get the overtime. So, I wouldn't want to speak of the monolithically either.\n\nBut, as you talk about the friction, it came from many sources. It's come certainly internally from people who even though we've carefully vetted and got rid of some people, people who were still dug in and were not going to change. So, they have had to be moved around. In many cases they have departed voluntarily because we have a pretty robust hiring environment in Philly for lawyers. We have been filling more and more positions, which has really been kind of great.\n\nWe got a lot of friction for our newspaper, the Philadelphia Inquirer, which should know better because 25 years ago is was a great investigative journalistic paper, but you know, as with much of mainstream traditional journalism, the paper got thinner and thinner. The ownership got richer and richer. It has ideologically gone a different direction, so we've been getting clobbered by the local paper for months. It's now starting to turn around, it's now starting to be a little but more sympathetic, but there was that friction as well.\n\nI mean, look, I was a criminal defense lawyer for 30 years. You go into the court room and for the most part the system hates you, and they treat you that way. So, I was kind of used to that, that was nothing new for me. To go into the DA's office and have some people there not like you right away is expected.\n\nI don't really even expected that the prosecutors who work there necessarily agree with me, that’s not the point. I am a big believer in freedom of thought and speech. The only thing I care about is they carry out the mission. That means when we have policies, and we came in and pretty quickly put down a bunch of policies, they've got to follow them. If they're unwilling to follow them or they're going to deliberately undermine us in court, then they too have to go, and we have to continue to replace them with people who are willing to carry out the mission.\n\nCHRIS HAYES: I'm hearing personnel is policy from you in some ways.\n\nLARRY KRASNER: Personnel is policy because culture eats policy all day long. If you talk to any of the progressive DA's who've gotten in there, you can pass whatever policy you want, and when your mid-level supervisor crunches it up and puts it in the trash can and it's not being carried out in the courtroom, they've all got a little grin on their face and you don't have any change.\n\nSo, it is a process, and it's not easy to take an office that for decades has hired its own and fired people who felt differently, it's a real process to take those people and redirect them. But, there's an awful lot of them who with the proper education, which they have not been given, with the facts, which they have not been fed, are willing to go a different direction. That's part of the challenge is to bring along the many, many good people there while you get rid of the ones who frankly just can't be changed.\n\nCHRIS HAYES: The reason I'm so interested in this is because I've had in some weird way kind of a similar... I mean, it's very different, and the stakes are very different, I didn't have human lives on my hands. But, you know, I sort of was like a journalist who came up as a critic of quote, \"The mainstream media.\" Lots of things about the conventions and affects of mainstream media, particularly cable news, the conventions of which can be just stultifying and terrible.\n\nThen, had to host a cable news show, and you just recognize the sort of the gravity of institutional inertia and how things operate in a new way that you didn't before. Like, are there things that you were wrong about? Are there things that you, Larry Krasner, district attorney, want to go back in time and tell Larry Krasner cop suer?\n\nLARRY KRASNER: I think I'm probably wrong a lot, but at this point I'm sitting here only less than six months in, less than 10 percent of a four year term in, and, I guess if I were to go back, I would say maybe I did not understand, and I understand better now, how difficult it is to deal with the family of a victim. Or to deal directly with a victim, especially when you have a system that really only has one thing to offer them, which is a sentence, and a sentence is not that meaningful. It's not treatment for trauma, it's not an apology that is meaningful and sincere. It is not a full explanation of why this occurred. It is not a full explanation of whether or not this could occur again to that same victim or family, or maybe just somebody else, you know?\n\nIt's a very difficult place to be to have so much trauma. Having been visited on people who, in one way or another, you have to help. And having so few tools to deal with it. I mean, I had a conversation with Kim Ogg who's the relatively progressive DA in Houston, who said to me, she cries all the time now, and she never used to cry. Well, it's tough. That, I think, is something that maybe defense attorneys don't understand, of what police officers go through, and EMTs go through, and to some extent, DAs go through when they try to address theses heartbreaking situations.\n\nCHRIS HAYES: It's interesting you say that, because when I have done a lot, I've talked to a lot of police officers in the course of my reporting, and there's something that one police officer said to me once about, \"every interaction you're having, is with someone having their worst day.\" You know, human behavior, right, runs a spectrum from the most sublime, and ecstatic, and generous, to the most just vile and horrible and, you know, most of your interactions with a few human beings are happening at one end of that spectrum. It starts to really torque your world view, at a certain point, or the way you think about people.\n\nLARRY KRASNER: I think that's true. And needless to say, as a defense attorney who tried a lot of homicides, I certainly had seen enough horrifying photographs and heard enough awful facts, and seen a lot of traumatized witnesses talking about something terrible that they had witnessed, but it is a little bit different when you are dealing directly and privately with the family who's lost their 13 year old girl to a drive-by shooting, in which she had no involvement. That's just a very, very hard thing for them to face, and it's a hard thing for you to engage.\n\nCHRIS HAYES: You mentioned other progressive DAs. This is a kind of movement that's happened in this country. I think some of the... A lot of working criminal justice reform, is really starting to focus, I would say in the last, I feel like in the last four or five years, in how instrumental role, prosecutors and prosecutors' offices play in it. There's a guy at Fordham, a really great scholar named John Fath, who talks a lot about the role the prosecutors have just in a kind of numerical sense, about even when you don't change the underlying laws and statutes, prosecutors can charge more crimes, and ask for more time, and they can really drive mass incarceration almost single handedly, independent of what legislatures, or governors are doing. So, there's been this response to try to elect people like yourself in Philadelphia and other places. How have you approached it from a policy perspective of trying to kind of reduce mass incarceration from your perch?\n\nLARRY KRASNER: I think John Fath is right. The essence of the reason I really don't want any other job in government is that you have this tremendous discretion. I don't have to get other people to agree with me to look at a case, and say, \"no, I'm not gonna charge that person.\" Or, \"No, I'm gonna pursue the death penalty.\" That power is in the office, and it's recognized by the U.S. Supreme Court as being in the bones of that office. So, that's really important, to be able to actually do things without having to get buy in, without having to log roll. What policies have we brought about? It's basically the ability to say no, or it's the ability to stay your hand, which is real power. That is what Fath is talking about. So, for example, we're trying to get at the massive incarceration and mass supervision, and by the way, Pennsylvania's worst in the National average, and the country's the worst in the world. Philadelphia, until recently, was the most incarcerated of the 10 largest cities, and the poorest.\n\nCHRIS HAYES: Wow.\n\nRazor wire protects a perimeter of the Lee Correctional Institution in Bishopville, South Carolina. Sean Rayford / AP file\n\nLARRY KRASNER: So, these are real issues in Philly. Here's an example, we have more juvenile lifer re-sentencings because the U.S. Supreme Court determined that it was unconstitutional to give a life sentence to a juvenile who committed a murder.\n\nSo, we have more of those re-sentencings than any state in the United States, which means any country in the world. It's that extreme. During this administration, we're gonna go through about 150 of them, and that means we sit around a table, and determine whether the sentence we should recommend for the re-sentencing is 50 years, or it's time served at 20 years. We're doing this while looking at what the prior administration was willing to recommend before they left. Sometimes the numbers we're recommending are 10 years less. Sometimes they're the same, or even more. But, often they're gonna be 10 years less, or 15 years less.\n\nWell, think about that for a minute. You're looking at 10 years times what, $42,000, or maybe more. Or 15 years times $42,000, you're dealing with a half a million dollars, $600,000. And you're dealing with that in a city that has public schools that are starved for funding, and you're making a decision about where society's resources are gonna go, and I don't have to get that past anybody in the state legislature. That is a decision that, ultimately, is up to me.\n\nWhen we look at all of these juvenile lifers who've been released, in Pennsylvania, as a consequence of these re-sentencings, out of all of them, we have not one who has committed a serious violent crime. To the best of my knowledge, only one who's committed any crime. We're dealing with recidivism at a rate that is essentially equal, to a random selection of the population. They are no more dangerous. They're supposedly monsters who had to spend their entire lives in jail, but they're no more dangerous than the average person walking down the street.\n\nThat is, I think, an example, of the kind of power that we're talking about. But, there's also the power to say, \"No, I'm not going to pursue the death penalty.\" And there's also the power to do a couple other things we did.\n\nOne of which, was after we looked at the Pennsylvania Sentencing Guidelines, and we realized how excessive and inappropriate they were, we made a decision on a range of offenses that are not sex offenses, and not violent offenses, we made a decision that our offers to resolve those cases should be below the bottom end of the sentencing guidelines. Why? Because those are the sentencing guidelines that gave us a 700 percent increase in jail population, while the rest of the country was already drunk on 500 percent. They're just too high. It's that simple.\n\nBut because of the way the laws are written, and because of the discretion we have, we can recommend to the court, a sentence that is below all of that. We can also divert more cases, take them out of the prosecution process, hold people accountable, while not giving them a criminal record that will disable them from having economic success, from becoming economic providers for families, et cetera.\n\nWe also did something with cash bail that I think is really something that we're kind of proud of. Having looked at the example of D.C., where for 30 years they've had very successful bail system that never included money, we realized that Pennsylvania's legislature wouldn't give us a law, like they had in D.C., that says, \"Judges cannot use money.\" But, what we could do, is we, as an office, could make recommendations to judges in many different types offenses that were not sex offenses, and not violent offenses, and not felony possession of a weapon, we can make a recommendation, ordinarily, that we don't want any money.\n\nThe way we did this, is we looked at 26 different crimes, where ordinarily, the judges were given between $0 and $1,000 bail to get out of jail. Which means, the middle class people always got out, the rich people always got out, and the people who were completely broke, and could not find $250, stayed in jail, for months, at a price to the taxpayer of $135 a day, simply because they were broke.\n\nCHRIS HAYES: Right.\n\nLARRY KRASNER: So, we took those 26 crimes and we created a presumption that we will never ask for cash. That doesn't mean... Look, if Charles Manson shows up in Philly, and commits a minor offense, and we know he's Charles Manson, we're going for a bunch of cash bail. We want to keep him jail, right? But, it just means that the default position is we're not gonna ask for it. The consequence of this was, between the sentencing, policy, and the cash bail policy, that in the first 45 days, after we put these policies into effect, we saw reductions in the county jail population of about 13 people per day, where the reductions before the policy went into effect were about six people per day. You know, there was a doubling of the rate of reduction of people in our over-crowded county prisons as a consequence of these two policies, and that happened 45 days into the administration. It was an immediate effect. And we are at the point now, where Philadelphia is ready to close one of it's four county jails because there aren't any people in that jail.\n\nCHRIS HAYES: Really?\n\nLARRY KRASNER: Yup.\n\nCHRIS HAYES: And that's because of Larry Krasner?\n\nLARRY KRASNER: No, that is not because of me. It's because —\n\nCHRIS HAYES: Are they gonna... They should knock it down and call it the Larry Krasner Parking Lot.\n\nLARRY KRASNER: You know, that would be quite an honor. I've always wanted a parking lot named after me, but no... There's a reason the reduction was at six before we did that.\n\nCHRIS HAYES: Right.\n\nLARRY KRASNER: There is a tendency and a trend towards de-carceration. Some of it has to do with a particular piece of Federal Law. It was a decision called a lien by the U.S. Supreme Court. A lot of it has to do with the reality that California's going broke keeping people in jail, and even though they were at the vanguard of giving people three strikes, life sentences, and things of that sort, once they ran into the reality of what that means a decade or two later, they decided it was time to let them back out. It is not a sustainable situation to wait until everybody who used to be walking down the street is in jail. That is also not a good outcome, in any sense. So, people are getting increasing fed up with it.\n\nBut, you know, we can't wait 30 years to get this right. There is, in fact, what King talked about. There is a fierce urgency of now, that we have to do these things right now. We can't slow down, we have to take the momentum like any good movement does, and we have to move forward.\n\nCHRIS HAYES: Is there... I wonder how much the fact that crime has been declining generally for a while, creates the conditions in which you can do this. And if there was a 20 percent spike in crime in Philly next year, you would be absolutely toast.\n\nLARRY KRASNER: I think that your point is well taken, that since 1992, nationally, there has been a, frankly, unexplained decline in crime. There are many different theories, by the way, yes, I have —\n\nCHRIS HAYES: It's the greatest sociological mystery of our time. It's like a miracle. It was 2,300 people got murdered in New York City when I first started going down to high, my junior high school in 1992, and there was 350 or something last year. Nothing else around any where declines by 80 percent, or whatever the heck that is.\n\nLARRY KRASNER: It is mysterious, and I think it is a fair statement, if you read John Fath, which I'm sure you have, because you're talking about him, but I think it's a fair statement that there was a brief period of time, during the crack epidemic, when an increased incarceration had a benefit. That was very short lived, and what we have done since then, is the political magnification in increase in incarceration, while there was a slow and steady decrease in crime since 1992. It is unexplained, you actually talked about that, in your book, which I read. Very nice book, by the way.\n\nCHRIS HAYES: Thank you.\n\nLARRY KRASNER: But, it's real. You can get a bunch of criminologists in a room and have them talk to each other, and there is no consensus on it, but we do know that there's been a decrease in crime. Do, I think that if there was a sudden increase in homicide for example, in Philly, that would be the end of it? Well, the interesting thing is there was. And it happened last year, it happened at the end of 30 years of draconian conservative prosecutors running the show. It is in a moderate decline this year, as we are letting more and more people out of jail.\n\nBut, that narrative that you just applied, which is if there is a crime spike, then the progressives are out, doesn't seem to apply to conservatives. Somehow, all that they do is respond to a crime spike by saying what they've always said, which is, \"We're gonna be tough on crime.\" And they're okay.\n\nCHRIS HAYES: Oh, yeah. I mean, the police are amazing about this. I've watched this happen in New York where it's like, if crime is up, you need more police, and if crime is down, it's because the number of police you have are working and you better not cut back on police. It's always a one way ratchet.\n\nLARRY KRASNER: It's a good system, I gotta figure out the other ratchet.\n\nCHRIS HAYES: Right, it's not even the numbers in aggregate. I watched this happen with Bill de Blasio here where two police officers were brutally murdered by this maniac, who I'm sure you remember, said he was gonna put wings on a pig, and first he shoots his ex, and then he comes up to New York, and he essentially assassinates two officers, who are sitting in a car in Brooklyn. Just an absolutely horrifying crime. Just gut punch for the city, and that was when the cops turned their back on de Blasio when he went to the funeral. Man, I will tell you, it spooked him, it changed the way he behaved, it changed the way he talked. It really, I think, a turning point in some ways, for better or for worse, but a turning point in how the mayor dealt with the cops, how he talked about crime. In some ways, it's like the trauma and the horror always looms over anyone who's doing any job in the world of crime prevention.\n\nLARRY KRASNER: That's right. I think that does happen. A lot of the way these issues are addressed really does flow out of the history of yellow journalism. And the reality that crimes sell papers.\n\nCHRIS HAYES: Right, right.\n\nLARRY KRASNER: Therefore, if crime goes up X, then the coverage of crime will go up seven X, because that will sell papers. It's become this comic book narrative about how something bad happened, who can we blame? Let's blame the judge who should have had a crystal ball that he or she never had, let's blame the prosecutor, who should have had this person under the jail for doing a retail theft before this person went out and did a homicide. It's a false narrative.\n\nIt's something that has to be taken on directly. What we are doing is risk management. And we are, in many ways, no different than medicine. Doctors are not going to cure mortality, they can only improve conditions of life, that's the best they can do. We are not gonna end crime. The issue is, do we manage it well? That's the standard by which it has to be judged. Not the anecdotal, horrifying, individual case that is not emblematic of what's really going on generally, and is simply a horrifying thing to read in the morning.\n\nCHRIS HAYES: Is the power of the singular case, which is really a central aspect of the narrative upon which mass incarceration is built. I say this as someone who grew up every day and would go to the bus stop with the two tabloids of New York City right there in the newspaper boxes, and often grisly crimes. Is that a truth about human nature, or is that a truth about the yellow journalism, as you call it? Is it... What is it in your mind?\n\nLARRY KRASNER: I mean, there is a fundamental truth that, and Ronald Reagan knew this, and frankly, you can read this in the Bible, that when you're trying to explain a concept, you're much better telling a little story about person. It's in our children's stories. People identify with people. So, a story about an individual is much more palatable, even though it may ultimately be misleading or false, than looking at statistics, which are just not something we relate to terribly well.\n\nSo, that is a fundamental problem. And it's also part of the problem in politics, because if what you're gonna do is you're gonna elect Barack Obama because he is Jesus Christ and all the Saints, and then you're gonna figure out that he's not perfect, so he's the Devil, then we're locked into the same narrative. If it's all gonna be about the history of kings and queens, and it's gonna be about individual instead of being a broader view of what's happening generally in society, or maybe to the many subjects of the king and queen, then you're going to, I think, repeatedly have failures of movements because they're not viewed as movements, they're viewed as an individual who's attacked and taken down.\n\nCHRIS HAYES: You keep calling it a movement, I think it is. Where is this movement at this moment that you talked to? The sort of, criminal justice reform movement in the country.\n\nLARRY KRASNER: Nationally, I think it's doing very well. I mean, for example, I'm in D.C. right now on this microphone, and the reason I'm here is there's a gathering of a bunch of progressive prosecutors. Among them. George Gascón from San Francisco, Kim Fox from Chicago, Eric Gonzalez from Brooklyn, and about 20 others, and we are all getting together to look at issues around juvenile justice, and talk about best practices, and hear from expert for about two or three days. We view ourselves as being a movement.\n\nBut locally, in Philadelphia, it is also a movement, a different kind. It's a much more grass roots, I would say activist organized movement, that not only has shown its political chops, but is currently showing its chops in terms of being able to answer the mainstream press, and talk about the broader issues, and express the views of people in the poorest of the 10 largest cities, about what they actually want out of the criminal justice system, and where they want their resources to be put.\n\nWhen I say that, I truly view this as being a movement. I really mean that. I think that this is something that is coming from the people, which is as it should be. It's going to be very powerful where those kinds of movements can be organized, and no, it's not gonna be everywhere. But it's gonna be very powerful, and it's gonna be like every other movement. This struggle is gonna go on for many years, maybe a decade, maybe two. Then, everybody's gonna look around at a much more liberated, much more progressive criminal justice system, and they're gonna say, \"Well, of course, this is the way it always should have been, and I don't know why it wasn't. Isn't that a strange blip that happened between the early 1980s and the late 2010s?\"\n\nCHRIS HAYES: I hope you're right Larry Krasner. You got me feeling hopeful. Maybe someone will point to the Larry Krasner Parking Lot and say...\n\nLARRY KRASNER: Say, \"Here's the thing, it's a movement, so it's gonna have to be a movement parking lot.\"\n\nCHRIS HAYES: It's a movement parking lot. There you go.\n\nLarry Krasner is the District Attorney of Philadelphia. Six months into that job, as you hear, and things are already changing rapidly. It's was a really, really fascinating conversation, Larry, thanks so much.\n\nLARRY KRASNER: Thank you for having me, it was a pleasure.\n\nLARRY KRASNER: \"Why Is This Happening\" is presented by MSNBC and NBC News Think, produced by the All In Team, music, by Eddie Cooper.\n\nCHRIS HAYES: You can get more from \"Why Is This Happening\" by visiting NBCNews.com/WhyIsThisHappening.", "authors": [], "url": "https://www.nbcnews.com/think/opinion/how-prosecutors-can-help-end-mass-incarceration-larry-krasner-podcast-ncna890126"}, {"title": "Inside the site of one of the deadliest cave accidents in US", "text": "Inside the site of one of the deadliest cave accidents in US copied!\n\nOne of the deadliest cave disasters in American history took place 25 years ago when a flash flood roared through a cave near St. Louis. NBC national correspondent Miguel Almaguer visits the site where six people died when the tragedy hit, providing a glimpse into some of the conditions members of the trapped Thailand soccer team have withstood.\n\nRead More", "authors": [], "url": "https://www.today.com/video/inside-the-site-of-one-of-the-deadliest-cave-accidents-in-us-1273702979602"}, {"title": "Dems shift into gear on Kavanaugh's paper trail", "text": "Dems shift into gear on Kavanaugh's paper trail copied!\n\nPresident Trump on Monday nominated Brett Kavanaugh, a federal appeals court judge in Washington, to succeed Justice Anthony Kennedy on the Supreme Court. The panel breaks down Kavanaugh's record and reaction from Democratic lawmakers.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/dems-shift-into-gear-on-kavanaugh-s-paper-trail-1273665091510"}, {"title": "If confirmed, how could Trump’s SCOTUS pick shape U.S. history?", "text": "If confirmed, how could Trump’s SCOTUS pick shape U.S. history? copied!\n\nAre presidents defined by their Supreme Court picks? Do the justices themselves have a bigger impact on history? We talk to two Pulitzer Prize winners, Jon Meacham and David Maraniss for some perspective.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/if-confirmed-how-could-trump-s-scotus-pick-shape-u-s-history-1273525827624"}, {"title": "Sen. Warren: Trump SCOTUS nominee is 'a political animal'", "text": "Sen. Warren: Trump SCOTUS nominee is 'a political animal' copied!\n\nIn her first reaction to Trump Supreme Court nominee Brett Kavanaugh, Sen. Elizabeth Warren tells Lawrence he is the “trifecta” for Trump: \"someone who will be committed to overturning Roe v. Wade, someone who will be committed to rolling back health care for millions of Americans, and someone who, it looks pretty likely, will help Donald Trump if he gets into serious criminal trouble.”\n\nRead More", "authors": [], "url": "http://www.msnbc.com/the-last-word/watch/sen-warren-trump-scotus-nominee-is-a-political-animal-1273505347697"}, {"title": "Booker: 'We cannot let this confirmation process go forward'", "text": "Booker: 'We cannot let this confirmation process go forward' copied!\n\nSenator Cory Booker talks with Rachel Maddow about what is at stake in Donald Trump's pick of Brett Kavanaugh to replace Justice Kennedy on the U.S. Supreme Court.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/booker-we-cannot-let-this-confirmation-process-go-forward-1273450563906"}, {"title": "Trump prioritizes self-protection in SCOTUS choice of Kavanaugh", "text": "Trump prioritizes self-protection in SCOTUS choice of Kavanaugh copied!\n\nDahlia Lithwick, legal correspondent and senior editor for Slate.com, talks with Rachel Maddow about Brett Kavanaugh's previously stated position on whether a sitting president can be indicted, and the role that likely played in Donald Trump choosing him for the Supreme Court.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/trump-prioritizes-self-protection-in-scotus-choice-of-kavanaugh-1273464387753"}, {"title": "Senator warns of 'dark money' behind Supreme Court process", "text": "Senator warns of 'dark money' behind Supreme Court process copied!\n\nDemocratic Senator Sheldon Whitehouse tells Ari Melber that the Judiciary Committee process has become a “joke” as a result of “special interests” infiltrating the Supreme Court nomination process and warns that Supreme Court cases are not being won on the “merits” of the case.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/the-beat-with-ari-melber/watch/senator-warns-of-dark-money-behind-supreme-court-process-1273402947549"}, {"title": "New lawyer for Michael Cohen fires warning shot at Trump", "text": "New lawyer for Michael Cohen fires warning shot at Trump copied!\n\nThe message from Cohen's new attorney, longtime Clinton ally Lanny Davis, is the latest sign that Cohen may be ready to cooperate.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/all-in/watch/new-lawyer-for-michael-cohen-fires-warning-shot-at-trump-1273436739712"}, {"title": "Trump provides controversial Oregon ranchers with full pardons", "text": "Two Oregon ranchers, Dwight and Steven Hammond, were accused of setting fire to federal lands several years ago. They were convicted, served several months behind bars, and released.\n\nLater, however, a federal judge ordered the father-and-son ranchers back to prison because, under federal law, there was a mandatory minimum for arson on federal land that they had not yet served. Their story later became a leading cause for militia members.\n\nThe Oregonian reported this morning, however, that Donald Trump has intervened in the Hammonds’ case.\n\nPresident Donald Trump on Tuesday commuted the sentences of two eastern Oregon ranchers serving time in federal prison for setting fire to public land in a case that inflamed their supporters and gave rise to the armed takeover of the Malheur National Wildlife Refuge. The decision will free Dwight Hammond Jr., 76, and son Steven Hammond, 49, convicted in 2012 of arson on Harney County land where they had grazing rights for their cattle.\n\nThe article added that, according to prosecutors, the Hammonds’ fires were used “to cover up illegal deer poaching,” and when the fires burned out of control, they placed firefighters “who had to be airlifted out of the area in grave danger.”\n\nAccording to the former U.S. Attorney in Oregon, the case followed years of alleged “permit violations and unauthorized fires” from the Hammonds, for which “they never accepted responsibility.”\n\nNevertheless, in a press statement, the White House said, “The Hammonds are devoted family men, respected contributors to their local community, and have widespread support from their neighbors, local law enforcement, and farmers and ranchers across the West. Justice is overdue for Dwight and Steven Hammond, both of whom are entirely deserving of these Grants of Executive Clemency.”\n\nThe news comes less than a week after Rep. Greg Walden (R-Ore.) said he’d spoken with the president about pardons for the Oregon ranchers.\n\nWhat’s more, this follows a series of controversial Trump pardons, including one six weeks ago for right-wing provocateur Dinesh D’Souza.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/trump-provides-controversial-oregon-ranchers-full-pardons"}, {"title": "U.S., North Korea deal already falling apart ?", "text": "Scott Pruitt: An embodiment of ethics in the Trump White House 04:53", "authors": [], "url": "http://www.msnbc.com/deadline-white-house/watch/u-s-north-korea-deal-already-falling-apart-1273318979845"}, {"title": "U.S., North Korea deal already falling apart ?", "text": "Scott Pruitt: An embodiment of ethics in the Trump White House 04:53", "authors": [], "url": "https://www.msnbc.com/deadline-white-house/watch/u-s-north-korea-deal-already-falling-apart-1273318979845"}, {"title": "Could Trump be a Russian intelligence asset?", "text": "Could Trump be a Russian intelligence asset? copied!\n\nNew York Magazine's Jonathan Chait lays out the most extreme possibility of Trump-Russia collusion: that Trump has been a Russian intelligence asset since 1987.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/all-in/watch/could-trump-be-a-russian-intelligence-asset-1273436739894"}, {"title": "Could Trump be a Russian intelligence asset?", "text": "Could Trump be a Russian intelligence asset? copied!\n\nNew York Magazine's Jonathan Chait lays out the most extreme possibility of Trump-Russia collusion: that Trump has been a Russian intelligence asset since 1987.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/all-in/watch/could-trump-be-a-russian-intelligence-asset-1273436739894"}, {"title": "MSNBC", "text": "Is banning selfies in the voting booth is a violation of free expression or legitimate way to combat fraud?\n\n\n\nThat’s the question that the First Circuit Court of Appeals in Boston will try to answer today — the first time a federal appeals court will consider the issue.\n\nAt issue is a 2014 New Hampshire law that makes it a crime, punishable by a fine of up to $1,000, for voters to take pictures of their ballots and share them on social media. Enforcement of the law was blocked a year ago by a federal judge, and the state appealed.\n\n\n\nOnly nine states appear to either explicitly allow ballot selfies or have no currently enforceable state law clearly forbidding it.\n\nMost of the states, 26, explicitly ban it through various laws, including prohibitions on bringing cameras into polling places.\n\nThe law is unclear in Arkansas, Connecticut, Hawaii, Idaho, Illinois, Kansas, Kentucky, Maryland, Minnesota, New Jersey, Ohio, Rhode Island, Vermont, and Washington.\n\nRead more here: http://on.msnbc.com/2ctqLrb", "authors": [], "url": "http://msnbc.tumblr.com/post/150358631304/but-first-you-might-want-to-rethink-that-selfie"}, {"title": "MSNBC", "text": "Is banning selfies in the voting booth is a violation of free expression or legitimate way to combat fraud?\n\n\n\nThat’s the question that the First Circuit Court of Appeals in Boston will try to answer today — the first time a federal appeals court will consider the issue.\n\nAt issue is a 2014 New Hampshire law that makes it a crime, punishable by a fine of up to $1,000, for voters to take pictures of their ballots and share them on social media. Enforcement of the law was blocked a year ago by a federal judge, and the state appealed.\n\n\n\nOnly nine states appear to either explicitly allow ballot selfies or have no currently enforceable state law clearly forbidding it.\n\nMost of the states, 26, explicitly ban it through various laws, including prohibitions on bringing cameras into polling places.\n\nThe law is unclear in Arkansas, Connecticut, Hawaii, Idaho, Illinois, Kansas, Kentucky, Maryland, Minnesota, New Jersey, Ohio, Rhode Island, Vermont, and Washington.\n\nRead more here: http://on.msnbc.com/2ctqLrb", "authors": [], "url": "http://msnbc.tumblr.com/post/150358631304/but-first-you-might-want-to-rethink-that-selfie#notes"}, {"title": "MSNBC", "text": "Tune in to the first joint candidate event of the 2016 general election!\n\nHillary Clinton and Donald Trump will take questions on national security, military affairs and veterans’ issues from a live audience comprised of service members and veterans on the Intrepid Sea, Air & Space Museum.", "authors": [], "url": "http://msnbc.tumblr.com/post/150030257059/tune-in-to-the-first-joint-candidate-event-of-the"}, {"title": "MSNBC", "text": "Tune in to the first joint candidate event of the 2016 general election!\n\nHillary Clinton and Donald Trump will take questions on national security, military affairs and veterans’ issues from a live audience comprised of service members and veterans on the Intrepid Sea, Air & Space Museum.", "authors": [], "url": "http://msnbc.tumblr.com/post/150030257059/tune-in-to-the-first-joint-candidate-event-of-the#notes"}, {"title": "MSNBC", "text": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere", "authors": [], "url": "http://msnbc.tumblr.com/post/149793580549/rudy-giuliani-sports-make-mexico-great-again"}, {"title": "MSNBC", "text": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere", "authors": [], "url": "http://msnbc.tumblr.com/post/149793580549/rudy-giuliani-sports-make-mexico-great-again#notes"}, {"title": "MSNBC", "text": "Video footage shows 5-year-old Omran Daqneesh being plucked away from the rubble in the aftermath of a devastating airstrike in Aleppo and carried inside an ambulance, looking dazed and flat-eyed.\n\nThe boy then runs his hand over his blood-covered face, looks at his hands and wipes them on the ambulance chair.\n\nWatch the heartbreaking video here: http://on.msnbc.com/2bfBhoO", "authors": [], "url": "http://msnbc.tumblr.com/post/149127174569/haunting-photo-of-wounded-boy-captures-horror-in"}, {"title": "MSNBC", "text": "Video footage shows 5-year-old Omran Daqneesh being plucked away from the rubble in the aftermath of a devastating airstrike in Aleppo and carried inside an ambulance, looking dazed and flat-eyed.\n\nThe boy then runs his hand over his blood-covered face, looks at his hands and wipes them on the ambulance chair.\n\nWatch the heartbreaking video here: http://on.msnbc.com/2bfBhoO", "authors": [], "url": "http://msnbc.tumblr.com/post/149127174569/haunting-photo-of-wounded-boy-captures-horror-in#notes"}, {"title": "MSNBC", "text": "“This is going to be tough to recover from,” said Ari Sarsalari, a meteorologist for The Weather Channel. “There are parts of Louisiana that have seen more than 30 inches of rain since Friday.”\n\n\n\nRead more here: http://on.msnbc.com/2aRTObT", "authors": [], "url": "http://msnbc.tumblr.com/post/149045580295/aerial-video-shows-the-true-devastation-of"}, {"title": "MSNBC", "text": "“This is going to be tough to recover from,” said Ari Sarsalari, a meteorologist for The Weather Channel. “There are parts of Louisiana that have seen more than 30 inches of rain since Friday.”\n\n\n\nRead more here: http://on.msnbc.com/2aRTObT", "authors": [], "url": "http://msnbc.tumblr.com/post/149045580295/aerial-video-shows-the-true-devastation-of#notes"}, {"title": "MSNBC", "text": "We’ve updated our NBC battleground map. The states in Hillary Clinton’s column now add up to 288 electoral votes, which exceeds the 270 needed to win the presidency. Donald Trump, meanwhile, is at 174 electoral votes, and an additional 76 are in the Tossup category. Our last map, back in July, showed Clinton with a 255-190 advantage — so Clinton’s tally has gone up since the conventions, while Trump’s has declined.\n\n\n\nThe significant changes in our map:\n\n\n\n- We’ve moved Colorado, New Hampshire, North Carolina, Pennsylvania, Virginia, and Nebraska’s one electoral vote from Tossup to Lean Dem.\n\n- We’ve also moved Florida from Lean Dem to Tossup.\n\n- Georgia moves from Lean GOP to Tossup.\n\n- And we’ve changed Kansas and South Carolina from Likely GOP to Lean GOP.\n\n(Our regular caveat here, of course: These designations are subject to change as we get more poll numbers and reporting.)\n\nExplore more here: http://on.msnbc.com/2bxZx7G\n\n", "authors": [], "url": "http://msnbc.tumblr.com/post/148981646309/clinton-surges-past-270-electoral-votes-in-new"}, {"title": "MSNBC", "text": "We’ve updated our NBC battleground map. The states in Hillary Clinton’s column now add up to 288 electoral votes, which exceeds the 270 needed to win the presidency. Donald Trump, meanwhile, is at 174 electoral votes, and an additional 76 are in the Tossup category. Our last map, back in July, showed Clinton with a 255-190 advantage — so Clinton’s tally has gone up since the conventions, while Trump’s has declined.\n\n\n\nThe significant changes in our map:\n\n\n\n- We’ve moved Colorado, New Hampshire, North Carolina, Pennsylvania, Virginia, and Nebraska’s one electoral vote from Tossup to Lean Dem.\n\n- We’ve also moved Florida from Lean Dem to Tossup.\n\n- Georgia moves from Lean GOP to Tossup.\n\n- And we’ve changed Kansas and South Carolina from Likely GOP to Lean GOP.\n\n(Our regular caveat here, of course: These designations are subject to change as we get more poll numbers and reporting.)\n\nExplore more here: http://on.msnbc.com/2bxZx7G\n\n", "authors": [], "url": "http://msnbc.tumblr.com/post/148981646309/clinton-surges-past-270-electoral-votes-in-new#notes"}, {"title": "Obama drops his 2016 summer playlist", "text": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere", "authors": [], "url": "http://msnbc.tumblr.com/post/148792213949/obama-drops-his-2016-summer-playlist"}, {"title": "Obama drops his 2016 summer playlist", "text": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere", "authors": [], "url": "http://msnbc.tumblr.com/post/148792213949/obama-drops-his-2016-summer-playlist#notes"}, {"title": "MSNBC", "text": "Donald Trump on Wednesday night appeared to blame President Barack Obama for the global terror threat, erroneously accusing him of creating ISIS and saying the group “honors” him.\n\n“In many respects, you know, they honor President Obama,” Trump said at a rally in Florida. “He’s the founder of ISIS. He’s the founder of ISIS. He’s the founder. He founded ISIS.”\n\nTrump continued: “I would say the co-founder would be crooked Hillary Clinton.”\n\nAnd then he doubled-down on his comments. Read more here: http://on.msnbc.com/2b1qldw", "authors": [], "url": "http://msnbc.tumblr.com/post/148790390931/trump-calls-obama-the-founder-of-isis-donald"}, {"title": "MSNBC", "text": "Donald Trump on Wednesday night appeared to blame President Barack Obama for the global terror threat, erroneously accusing him of creating ISIS and saying the group “honors” him.\n\n“In many respects, you know, they honor President Obama,” Trump said at a rally in Florida. “He’s the founder of ISIS. He’s the founder of ISIS. He’s the founder. He founded ISIS.”\n\nTrump continued: “I would say the co-founder would be crooked Hillary Clinton.”\n\nAnd then he doubled-down on his comments. Read more here: http://on.msnbc.com/2b1qldw", "authors": [], "url": "http://msnbc.tumblr.com/post/148790390931/trump-calls-obama-the-founder-of-isis-donald#notes"}, {"title": "MSNBC", "text": "They are the first-ever Refugee Olympic Team — five South Sudanese runners, two swimmers from Syria, two Congolese judokas and a marathoner from Ethiopia competing under a single banner.\n\n\n\nThe collection of athletes represent refugee crises old and new. Unlike their fellow teammates from Syria, Ethiopia and the Democratic Republic of the Congo, whose pangs of homesickness are still fresh, the South Sudanese runners are a testament to the festering repercussions of violent conflicts that never end.\n\nExiled from their homes for more than a decade, the five South Sudanese runners represent a generation of stateless people. “Refugee” is the banner they’ve unwittingly carried for most of their lives; now they’re taking it up deliberately on the world stage.\n\n“Now, I have a mission to tell the world that we are refugees. We are human beings,” said Yiech Pur Biel, 21, who will run the men’s 800m race.\n\nExplore more here: http://on.msnbc.com/2aWSLFm\n\n\n\n(Photos: Newsha Tavakolian)", "authors": [], "url": "http://msnbc.tumblr.com/post/148693173369/they-were-forced-to-flee-their-homes-now-theyre"}, {"title": "MSNBC", "text": "They are the first-ever Refugee Olympic Team — five South Sudanese runners, two swimmers from Syria, two Congolese judokas and a marathoner from Ethiopia competing under a single banner.\n\n\n\nThe collection of athletes represent refugee crises old and new. Unlike their fellow teammates from Syria, Ethiopia and the Democratic Republic of the Congo, whose pangs of homesickness are still fresh, the South Sudanese runners are a testament to the festering repercussions of violent conflicts that never end.\n\nExiled from their homes for more than a decade, the five South Sudanese runners represent a generation of stateless people. “Refugee” is the banner they’ve unwittingly carried for most of their lives; now they’re taking it up deliberately on the world stage.\n\n“Now, I have a mission to tell the world that we are refugees. We are human beings,” said Yiech Pur Biel, 21, who will run the men’s 800m race.\n\nExplore more here: http://on.msnbc.com/2aWSLFm\n\n\n\n(Photos: Newsha Tavakolian)", "authors": [], "url": "http://msnbc.tumblr.com/post/148693173369/they-were-forced-to-flee-their-homes-now-theyre#notes"}, {"title": "MSNBC", "text": "Colin Jost and Michael Che are rehearsing for the show, which will be broadcast on MSNBC at 12am ET.\n\nWatch clips from last week’s RNC edition here: http://on.msnbc.com/2awFkP7", "authors": [], "url": "http://msnbc.tumblr.com/post/148067133784/dont-miss-a-special-dnc-edition-of-snls-weekend"}, {"title": "MSNBC", "text": "Colin Jost and Michael Che are rehearsing for the show, which will be broadcast on MSNBC at 12am ET.\n\nWatch clips from last week’s RNC edition here: http://on.msnbc.com/2awFkP7", "authors": [], "url": "http://msnbc.tumblr.com/post/148067133784/dont-miss-a-special-dnc-edition-of-snls-weekend#notes"}, {"title": "Trump SCOTUS nominee’s record on presidential investigations and abortion", "text": "Trump SCOTUS nominee’s record on presidential investigations and abortion copied!\n\nRon Klain says the Senate Judiciary Committee must ask Brett Kavanaugh if he gave the Trump White House any “assurances” about the Mueller investigation. Cecile Richards and Neera Tanden discuss what the nominee would mean to Roe v. Wade.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/the-last-word/watch/trump-scotus-nominee-s-record-on-presidential-investigations-and-abortion-1273509443689"}, {"title": "Senator Susan Collins on Supreme Court nominee Brett Kavanaugh", "text": "Senator Susan Collins on Supreme Court nominee Brett Kavanaugh copied!\n\nSenator Susan Collins (R-Maine) praises Supreme Court nominee Brett Kavanaugh as having, “impressive credentials and extensive experience.” Collins also comments on how Kavanaugh would handle challenges to the Roe v. Wade decision governing abortion.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/craig-melvin/watch/senator-susan-collins-on-supreme-court-nominee-brett-kavanaugh-1273911363831"}, {"title": "Raj Shah: Trump asked Kavanaugh broad questions, no hypotheticals", "text": "Raj Shah: Trump asked Kavanaugh broad questions, no hypotheticals copied!\n\nRaj Shah, White House Principle Deputy Press Secretary, reacts to concerns and questions over President Trump's Supreme Court nominee, Brett Kavanaugh: \"I’m going to let Justice Kennedy speak for himself. But the president's selection of Judge Kavanaugh was his own selection.\"\n\nRead More", "authors": [], "url": "https://www.msnbc.com/hallie-jackson/watch/raj-shah-trump-asked-kavanaugh-broad-questions-no-hypotheticals-1273838659787"}, {"title": "Trump: Putin Summit might be \"easiest of them all\"", "text": "Trump: Putin Summit might be \"easiest of them all\" copied!\n\nPrior to leaving US for the NATO summit, President Trump says his meeting with Vladimir Putin might the \"easiest of all.\"\n\nRead More", "authors": [], "url": "https://www.msnbc.com/rachel-maddow/watch/trump-putin-summit-might-be-easiest-of-them-all-1273753667852"}, {"title": "Michael Flynn’s legal team asks for expedited sentencing schedule", "text": "Michael Flynn’s legal team asks for expedited sentencing schedule copied!\n\nFormer White House National Security Advisor Michael Flynn was DC District Court Tuesday morning, where his lawyers appealed to set a trial date. NBC’s Ken Dilanian reports.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/hallie-jackson/watch/michael-flynn-s-legal-team-asks-for-expedited-sentencing-schedule-1273826883647"}, {"title": "Federal judge extends deadline to reunite separated families", "text": "Federal judge extends deadline to reunite separated families copied!\n\nThe federal government will not meet today’s deadline to reunite the youngest migrant children who are separated from their families. Stephanie Ruhle and Ali Velshi speak with Gabe Gutierrez about parents who are stuck in agonizing limbo as the courts demand a new timeline to get these families back together.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/velshi-ruhle/watch/federal-judge-extends-deadline-to-reunite-separated-families-1273951299598"}, {"title": "Trump's job approval falls in latest poll", "text": "Trump's job approval falls in latest poll copied!\n\nThe president's job approval number stands at 41 percent, with 56 percent disapproving of his job, according to the latest Gallup weekly tracking poll. What's behind the numbers?\n\nRead More", "authors": [], "url": "https://www.msnbc.com/morning-joe/watch/trump-s-job-approval-falls-in-latest-poll-1273664067898"}, {"title": "Schumer: Kavanaugh is far, far right on so many issues", "text": "Schumer: Kavanaugh is far, far right on so many issues 08:43", "authors": [], "url": "https://www.msnbc.com/morning-joe/watch/schumer-kavanaugh-is-far-far-right-on-so-many-issues-1273702467671"}, {"title": "Giuliani: Mueller probe most corrupt investigation I've ever seen", "text": "Giuliani: Mueller probe most corrupt investigation I've ever seen copied!\n\nAfter staying out of the limelight, Trump attorney Rudy Giuliani is back on TV with a new set of answers about whether Trump will agree to an interview with Mueller. Michael Schmidt & Mimi Rocah discuss.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/brian-williams/watch/giuliani-mueller-probe-most-corrupt-investigation-i-ve-ever-seen-1273514563730"}, {"title": "Dems shift into gear on Kavanaugh's paper trail", "text": "Dems shift into gear on Kavanaugh's paper trail copied!\n\nPresident Trump on Monday nominated Brett Kavanaugh, a federal appeals court judge in Washington, to succeed Justice Anthony Kennedy on the Supreme Court. The panel breaks down Kavanaugh's record and reaction from Democratic lawmakers.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/morning-joe/watch/dems-shift-into-gear-on-kavanaugh-s-paper-trail-1273665091510"}, {"title": "If confirmed, how could Trump’s SCOTUS pick shape U.S. history?", "text": "If confirmed, how could Trump’s SCOTUS pick shape U.S. history? copied!\n\nAre presidents defined by their Supreme Court picks? Do the justices themselves have a bigger impact on history? We talk to two Pulitzer Prize winners, Jon Meacham and David Maraniss for some perspective.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/brian-williams/watch/if-confirmed-how-could-trump-s-scotus-pick-shape-u-s-history-1273525827624"}, {"title": "Sen. Warren: Trump SCOTUS nominee is 'a political animal'", "text": "Sen. Warren: Trump SCOTUS nominee is 'a political animal' copied!\n\nIn her first reaction to Trump Supreme Court nominee Brett Kavanaugh, Sen. Elizabeth Warren tells Lawrence he is the “trifecta” for Trump: \"someone who will be committed to overturning Roe v. Wade, someone who will be committed to rolling back health care for millions of Americans, and someone who, it looks pretty likely, will help Donald Trump if he gets into serious criminal trouble.”\n\nRead More", "authors": [], "url": "https://www.msnbc.com/the-last-word/watch/sen-warren-trump-scotus-nominee-is-a-political-animal-1273505347697"}, {"title": "Booker: 'We cannot let this confirmation process go forward'", "text": "Booker: 'We cannot let this confirmation process go forward' copied!\n\nSenator Cory Booker talks with Rachel Maddow about what is at stake in Donald Trump's pick of Brett Kavanaugh to replace Justice Kennedy on the U.S. Supreme Court.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/rachel-maddow/watch/booker-we-cannot-let-this-confirmation-process-go-forward-1273450563906"}, {"title": "Trump prioritizes self-protection in SCOTUS choice of Kavanaugh", "text": "Trump prioritizes self-protection in SCOTUS choice of Kavanaugh copied!\n\nDahlia Lithwick, legal correspondent and senior editor for Slate.com, talks with Rachel Maddow about Brett Kavanaugh's previously stated position on whether a sitting president can be indicted, and the role that likely played in Donald Trump choosing him for the Supreme Court.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/rachel-maddow/watch/trump-prioritizes-self-protection-in-scotus-choice-of-kavanaugh-1273464387753"}, {"title": "Senator warns of 'dark money' behind Supreme Court process", "text": "Senator warns of 'dark money' behind Supreme Court process copied!\n\nDemocratic Senator Sheldon Whitehouse tells Ari Melber that the Judiciary Committee process has become a “joke” as a result of “special interests” infiltrating the Supreme Court nomination process and warns that Supreme Court cases are not being won on the “merits” of the case.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/the-beat-with-ari-melber/watch/senator-warns-of-dark-money-behind-supreme-court-process-1273402947549"}, {"title": "New lawyer for Michael Cohen fires warning shot at Trump", "text": "New lawyer for Michael Cohen fires warning shot at Trump copied!\n\nThe message from Cohen's new attorney, longtime Clinton ally Lanny Davis, is the latest sign that Cohen may be ready to cooperate.\n\nRead More", "authors": [], "url": "https://www.msnbc.com/all-in/watch/new-lawyer-for-michael-cohen-fires-warning-shot-at-trump-1273436739712"}, {"title": "Trump provides controversial Oregon ranchers with full pardons", "text": "Two Oregon ranchers, Dwight and Steven Hammond, were accused of setting fire to federal lands several years ago. They were convicted, served several months behind bars, and released.\n\nLater, however, a federal judge ordered the father-and-son ranchers back to prison because, under federal law, there was a mandatory minimum for arson on federal land that they had not yet served. Their story later became a leading cause for militia members.\n\nThe Oregonian reported this morning, however, that Donald Trump has intervened in the Hammonds’ case.\n\nPresident Donald Trump on Tuesday commuted the sentences of two eastern Oregon ranchers serving time in federal prison for setting fire to public land in a case that inflamed their supporters and gave rise to the armed takeover of the Malheur National Wildlife Refuge. The decision will free Dwight Hammond Jr., 76, and son Steven Hammond, 49, convicted in 2012 of arson on Harney County land where they had grazing rights for their cattle.\n\nThe article added that, according to prosecutors, the Hammonds’ fires were used “to cover up illegal deer poaching,” and when the fires burned out of control, they placed firefighters “who had to be airlifted out of the area in grave danger.”\n\nAccording to the former U.S. Attorney in Oregon, the case followed years of alleged “permit violations and unauthorized fires” from the Hammonds, for which “they never accepted responsibility.”\n\nNevertheless, in a press statement, the White House said, “The Hammonds are devoted family men, respected contributors to their local community, and have widespread support from their neighbors, local law enforcement, and farmers and ranchers across the West. Justice is overdue for Dwight and Steven Hammond, both of whom are entirely deserving of these Grants of Executive Clemency.”\n\nThe news comes less than a week after Rep. Greg Walden (R-Ore.) said he’d spoken with the president about pardons for the Oregon ranchers.\n\nWhat’s more, this follows a series of controversial Trump pardons, including one six weeks ago for right-wing provocateur Dinesh D’Souza.", "authors": [], "url": "https://www.msnbc.com/rachel-maddow-show/trump-provides-controversial-oregon-ranchers-full-pardons"}, {"title": "President Trump heads to NATO Summit after attacking allies", "text": "President Trump heads to NATO Summit after attacking allies copied!\n\nPresident Trump is on his way to a NATO Summit after tweeting attacks at our allies. The European Council President is warning “Dear America, appreciate your allies, after all you don’t have all that many.” Ali Velshi and Stephanie Ruhle are joined by Senior Fellow at the Center for American Progress, Michael Fuchs, about what we can expect from this summit.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/president-trump-heads-to-nato-summit-after-attacking-allies-1273948227908"}, {"title": "What to expect from Judge Brett Kavanaugh", "text": "What to expect from Judge Brett Kavanaugh copied!\n\nAli Velshi and Stephanie Ruhle break down what we can expect from President Trump’s Supreme Court nominee and how he might affect the court. Weighing in: NBC Justice Correspondent Pete Williams and the President of the Center for Reproductive Rights, Nancy Northup.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/what-to-expect-from-judge-brett-kavanaugh-1273940547665"}, {"title": "Where Judge Kavanaugh stands on issues", "text": "Where Judge Kavanaugh stands on issues copied!\n\nPresident Trump has nominated conservative Judge Brett Kavanaugh to replace Justice Anthony Kennedy. Ali Velshi breaks down where Judge Kavanaugh stands on abortion, gay rights, Obamacare and the Mueller investigation.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/where-judge-kavanaugh-stands-on-issues-1273935939605"}, {"title": "Kavanaugh's Fmr. Colleague: the SCOTUS pick will think for himself", "text": "Kavanaugh's Fmr. Colleague: the SCOTUS pick will think for himself copied!\n\nKim Wehle, Professor of Law at University of Baltimore School of Law, and former colleague of Brett Kavanaugh, gives insight to what it was like being a colleague of the Supreme Court nominee: \"He’s going to stand out as someone who makes a real imprint on this court one way or another.\"\n\nRead More", "authors": [], "url": "http://www.msnbc.com/hallie-jackson/watch/kavanaugh-s-fmr-colleague-the-scotus-pick-will-think-for-himself-1273932355823"}, {"title": "Where does the U.S. stand ahead of NATO summit?", "text": "Where does the U.S. stand ahead of NATO summit? copied!\n\nThe President is heading to Brussels for the NATO Summit today after repeatedly attacking allies on their defense spending. Christine Wormuth, the former Under Secretary of Defense for policy, says that the President should take credit for half of these allies increasing their spending, instead of attacking them.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/andrea-mitchell-reports/watch/where-does-the-u-s-stand-ahead-of-nato-summit-1273890883753"}, {"title": "Ahead of NATO summit, Trump again lashes out at American allies", "text": "On the eve of the latest NATO summit, European Council President Donald Tusk urged Donald Trump to recognize “who is your strategic friend and who is your strategic problem.”\n\nThe Associated Press report on this added that the former Polish prime minister, who chairs summits of EU leaders and will take part in the NATO meeting, went on to say, “Dear America, appreciate your allies, after all you don’t have all that many.”\n\nTrump doesn’t appear to be listening.\n\nPresident Donald Trump criticized NATO on Tuesday in a pair of tweets ahead of his seven-day European trip this week, accusing U.S. allies of exploiting America on defense spending. “Getting ready to leave for Europe. First meeting - NATO. The U.S. is spending many times more than any other country in order to protect them. Not fair to the U.S. taxpayer. On top of that we lose $151 Billion on Trade with the European Union. Charge us big Tariffs (& Barriers)!” the president wrote in a tweet, adding in a later tweet, “NATO countries must pay MORE, the United States must pay LESS. Very Unfair!”\n\nI realize fact-checking these little tantrums probably does little good, but the president still doesn’t understand, among other things, that a trade deficit does not mean we’re “losing” money.\n\nAs for the idea that NATO members’ defense spending is unfair to American taxpayers, that would only make sense if Trump wanted to decrease defense spending in the United States. He doesn’t.\n\nBut factual details aside, the American president went on to speak briefly with reporters on the White House’s South Lawn this morning, where he commented on his upcoming travel plans. “I have NATO, I have the UK, which is in somewhat turmoil, and I have Putin,” Trump said. “Frankly, Putin may be the easiest of them all. Who would think?”\n\nI’ll assume that was a rhetorical question.\n\nThe broader point, of course, is that Trump is poised to attend an international gathering with many of our closest allies, and he seems preoccupied with whining about them. This morning’s complaints come on the heels of related complaints yesterday, which follow a series of criticisms the president directed at Europe last week.\n\nThe New York Times added yesterday, “This year’s NATO meeting, which begins on Wednesday, comes just days before Mr. Trump’s planned meeting with President Vladimir V. Putin of Russia in Helsinki, Finland. As he has prepared for Brussels, Mr. Trump has accused Europe of exploiting the United States and hinted that he might play the role of agitator at NATO, sowing disagreement among allies, which would play into Mr. Putin’s hands.”\n\nThe Washington Post reported two days earlier than some U.S. allies fear that Trump “will blow up a key summit focused on Europe’s defense and then offer concessions to NATO’s main adversary” in Moscow.\n\nIt’s a familiar dynamic, isn’t it? America’s amateur president, uninterested in the Western alliance the United States fought so hard to build, is alienating and frightening many of his nation’s most reliable friends, to the delight of the autocratic adversary who took steps to put him in power, and whom he’ll soon meet for a summit.\n\nIf there’s a silver lining to any of this, it’s that Trump probably won’t be able to fall below the exceedingly low expectations many observers have for his foreign excursion.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/ahead-nato-summit-trump-again-lashes-out-american-allies"}, {"title": "Supreme Court fight creates a unique challenge for red-state Dems", "text": "There are several centrist Senate Democrats up for re-election this year in states Donald Trump won with relative ease two years ago, and none of them is likely looking forward to the upcoming fight over Judge Brett Kavanaugh’s Supreme Court nomination.\n\nIndeed, the pressure began before the announcement was even made, when the White House invited three of these Senate Dems – Indiana’s Joe Donnelly, West Virginia’s Joe Manchin, and North Dakota’s Heidi Heitkamp – to last night’s event. They all politely declined.\n\nThe pressure, however, is just getting started.\n\nWithin minutes of President Donald Trump announcing Brett Kavanaugh as his Supreme Court nominee, a conservative judicial advocacy group unveiled a $1.4 million ad buy aimed at pressuring four vulnerable Democrats to support him. The Judicial Crisis Network announced its “Confirm Kavanaugh” campaign of cable and digital ads in Alabama, Indiana, North Dakota and West Virginia. These all happen to be Republican-majority states with a Democratic senator: Doug Jones (Ala.), Joe Donnelly (Ind.), Heidi Heitkamp (N.D.) and Joe Manchin (W.Va.).\n\nAt first blush, this may seem like the kind of tactic the president’s allies would utilize if they were working to secure the nominee’s confirmation. But that’s not the political dynamic unfolding on Capitol Hill right now, where the Senate Republican majority can confirm Kavanaugh entirely on its own, without any Democratic votes.\n\nRather, the pressure campaign is driven entirely by electoral considerations: the right hopes to use the Supreme Court fight to defeat some Democratic incumbents and ensure that the Senate remains under Republican control.\n\nBut while many see this as an “agonizing” choice for red-state Dems, I have a hunch we know how this will play out.\n\nIn this 51-49 Senate, with Sen. John McCain (R-Ariz.) ailing in Arizona, the strategy for the left isn’t complicated: keep Senate Democrats together and find a Republican or two who might not be comfortable casting a vote to move the Supreme Court even further to the right. The most likely suspects are Sens. Susan Collins of Maine and Lisa Murkowski of Alaska.\n\nLet’s say for the sake of conversation that the centrist Dems in question would like to oppose Trump’s nominee, but they’re understandably concerned that the vote would be used against them in their tough re-election fights. So do they prioritize their principles or their political survival?\n\nThe answer, it seems to me, is to wait and watch Collins and Murkowski. If the more moderate Republicans balk at Kavanaugh, red-state Democrats will have bipartisan cover to do the same. If Collins and Murkowski throw their support behind the president’s nominee, then Kavanaugh will be confirmed anyway, and red-state Democrats can cast their votes with the knowledge that they won’t change the outcome either way.\n\nI don’t imagine this will be an enjoyable process for them, but it’s not that tough.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/supreme-court-fight-creates-unique-challenge-red-state-dems"}, {"title": "Sen. Schumer slams Trump for 'absurd' border remark", "text": "Schumer: Kavanaugh is far, far right on so many issues 08:43", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/sen-schumer-slams-trump-for-absurd-border-remark-1273708099541"}, {"title": "Kavanaugh potentially influential if he passes confirmation", "text": "Kavanaugh potentially influential if he passes confirmation copied!\n\nNina Totenberg, legal affairs correspondent for NPR, talks with Rachel Maddow about why Brett Kavanaugh's political past and bench experience would potentially make him an influential Supreme Court justice, though his lengthy record could also make his confirmation arduous.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/kavanaugh-potentially-influential-if-he-passes-confirmation-1273503811504"}, {"title": "Kavanaugh gives Democrats 'ample opportunity to get to no'", "text": "Kavanaugh gives Democrats 'ample opportunity to get to no' copied!\n\nAdam Jentleson, former senior aide to Senator Harry Reid, talks with Rachel Maddow about whether Senate Democrats can maintain a unified opposition to Donald Trump's Supreme Court choice of Brett Kavanaugh.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/kavanaugh-gives-democrats-ample-opportunity-to-get-to-no-1273501763690"}, {"title": "Feingold: Supreme Court becoming 'Kangaroo Court' under Trump", "text": "Feingold: Supreme Court becoming 'Kangaroo Court' under Trump copied!\n\nSources tell NBC News Trump there are two front-runners for Trump’s Supreme Court nomination as Democrats vow to block virtually any Trump nominee. Former Texas State Senator Wendy Davis tells Ari Melber that the Federalist Society, whose list of nominees Trump is reportedly deciding from, has overturning Roe. V. Wade as one of its “primary goals”.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/the-beat-with-ari-melber/watch/feingold-supreme-court-becoming-kangaroo-court-under-trump-1273398339667"}, {"title": "Sen. Coons: Dems have few options on SCOTUS pick", "text": "Sen. Coons: Dems have few options on SCOTUS pick copied!\n\nSen. Chris Coons, D-Del., weighs in on the president's Supreme Court nominee, which Trump is scheduled to name on Monday evening. Sen. Coons says while Trump's pick shouldn't be considered, there is little Democrats can do to block the confirmation.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/sen-coons-dems-have-few-options-on-scotus-pick-1272954947773"}, {"title": "NYSE's first female president: I'm thinking of the \"average person\"", "text": "NYSE's first female president: I'm thinking of the \"average person\" copied!\n\nMoney, Power, Politics: The markets are up this morning and Stacey Cunningham, the first female president of the NYSE, joins Stephanie Ruhle to discuss “how to strike the right balance” in scaling back regulations and women in leadership positions in major companies.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/nyse-s-first-female-president-i-m-thinking-of-the-average-person-1273788995625"}, {"title": "How a universal basic income would impact the US", "text": "How a universal basic income would impact the US copied!\n\nAuthor Annie Lowrey joins Morning Joe to discuss \"Give People Money,' her new book on how a universal basic income would impact poverty and the world.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/how-a-universal-basic-income-would-impact-the-us-1273761347825"}, {"title": "Swonk on Trump’s tariffs: 'This is a tax'", "text": "Swonk on Trump’s tariffs: 'This is a tax' copied!\n\nPresident Trump’s trade war with some of America’s largest trading partners appears to be in full swing. Ali Velshi talks with Grant Thornton Chief Economist Diane Swonk about how the tariffs will impact consumers, businesses, and the economy.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/ali-velshi/watch/swonk-on-trump-s-tariffs-this-is-a-tax-1273257027649"}, {"title": "Money, Power, Politics: How the trade war could hit your wallet", "text": "Money, Power, Politics: How the trade war could hit your wallet copied!\n\nYour 401k may not be taking a hit right now from the trade war, but your wallet soon could. Stephanie Ruhle breaks down what could be costing you. Weighing in: CNBC Contributor Dan Nathan\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/money-power-politics-how-the-trade-war-could-hit-your-wallet-1273012803780"}, {"title": "Expect Trump's NATO trip to be like the G-7 trip?", "text": "Expect Trump's NATO trip to be like the G-7 trip? copied!\n\nOn July 16, President Donald Trump will meet in the Finnish capital of Helsinki with Russian President Vladimir Putin. The meeting will come as the president continues remarks about NATO ahead of the summit in Brussels. Dan Drezner joins the discussion.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/expect-trump-s-nato-trip-to-be-like-the-g-7-trip-1272972867976"}, {"title": "How do you retain young talent?", "text": "How do you retain young talent? copied!\n\nJune 10, 2018: How can you hold onto younger talent at your business once you’ve trained them instead of losing them to bigger businesses? Let’s ask the expert. Scott Gurfein is an entrepreneur, investor and chairman at AllWork.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/your-business/watch/how-do-you-retain-young-talent-1251132995945"}, {"title": "Utilize new power to run your business", "text": "Utilize new power to run your business copied!\n\nJune 10, 2018: Power exists in many new forms thanks largely to social media. As a business owner, you can tap into this power by getting people to add energy to your cause. One way is by creating the right incentives to encourage them to engage. Co-authors Jeremy Heimans and Henry Timms share that advice and more for building brand loyalty.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/your-business/watch/utilize-new-power-to-run-your-business-1251135043628"}, {"title": "5 ways to be more confident in a meeting", "text": "5 ways to be more confident in a meeting copied!\n\nJune 10, 2018: The way you present yourself in a business gathering can have a great impact on your career. Here are five ways you can feel more confident when talking to your colleagues and other peers.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/your-business/watch/5-ways-to-be-more-confident-in-a-meeting-1251139139897"}, {"title": "Top tip: Prove people right", "text": "Top tip: Prove people right copied!\n\nJune 10, 2018: Excel in your expertise and forget about proving people wrong, prove them right! Those are the top two tips for growing your business. Melissa Biggs Bradley is the founder and CEO of Indagare Travel and Chris Sugden is a managing partner at Edison Partners.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/your-business/watch/top-tip-prove-people-right-1251153987582"}, {"title": "This Baby Boomer knows all the digital trends", "text": "This Baby Boomer knows all the digital trends copied!\n\nJune 10, 2018: Tech is largely dominated by new products and fresh young faces, but that’s not stopping Robin Raskin. She has been in the industry for more than 40 years and shows no signs of backing down. Even though she spends most of her days surrounded by people decades younger than her, she’s figured out how to stay relevant in the field long after many of her peers have called it quits.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/your-business/watch/this-baby-boomer-knows-all-the-digital-trends-1250564675743"}, {"title": "Trump speeches and speech pattern analyzed by linguistics professor", "text": "Trump speeches and speech pattern analyzed by linguistics professor copied!\n\nDonald Trump’s speeches and speech pattern are analyzed by Columbia linguistics professor John McWhorter, who calls him, ‘the first president who doesn't give us statements that he's thought about.’\n\nRead More", "authors": [], "url": "http://www.msnbc.com/am-joy/watch/trump-speeches-and-speech-pattern-analyzed-by-linguistics-professor-1272588867721"}, {"title": "Exposed: Betsy DeVos’s record of dismantling student protections", "text": "Exposed: Betsy DeVos’s record of dismantling student protections copied!\n\nIn a “Beat” special report, Ari Melber examines Trump education secretary Betsy DeVos’s track record of rolling back years of policy in ways that affect millions of students, including ending programs that support diversity in schools.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/the-beat-with-ari-melber/watch/exposed-betsy-devos-s-record-of-dismantling-student-protections-1271865411743"}, {"title": "Trump administration urges colleges and universities to abandon affirmative action", "text": "Trump administration urges colleges and universities to abandon affirmative action copied!\n\nThe Trump administration has announced that it is rescinding Obama-era affirmative action guidelines. Ali Velshi talks about what the decision means with Anurima Bhargava, who helped draft the guidance when she served as chief of the Educational Opportunities Section in the Justice Department’s Civil Rights Division during the Obama administration.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/ali-velshi/watch/trump-administration-urges-colleges-and-universities-to-abandon-affirmative-action-1269632579665"}, {"title": "Nicki Minaj offers scholarship money", "text": "Nicki Minaj offers scholarship money copied!\n\nMusic superstar Nicki Minaj is giving back to her fans in a big way. She is offering scholarships to help students pay for tuition, books, and student loans. #GoodNewsRUHLES\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/nicki-minaj-offers-scholarship-money-1269354051902"}, {"title": "President Trump’s plan to reorganize the government", "text": "President Trump’s plan to reorganize the government copied!\n\nPresident Trump wants to reorganize the federal government including a proposal to combine the education and labor departments. CNBC’s John Harwood joins Stephanie Ruhle to discuss what this could mean for students, workers, and some of the most vulnerable people in the country.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/president-trump-s-plan-to-reorganize-the-government-1261867075609"}, {"title": "Hogg siblings on how activism helps with healing", "text": "Hogg siblings on how activism helps with healing copied!\n\nLauren and David Hogg, siblings and survivors of the Feb. 14 mass shooting at Marjory Stoneman Douglas High, join Morning Joe to discuss their new book \"#NeverAgain: A New Generation Draws the Line\" and how activism has helped them begin healing.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/hogg-siblings-on-how-activism-helps-with-healing-1259942467980"}, {"title": "Warren: Trump shameless even about illegality", "text": "Warren: Trump shameless even about illegality copied!\n\nSenator Elizabeth Warren talks with Rachel Maddow about the extent to which Donald Trump's shameless corruption has infected other parts of the federal government.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/warren-trump-shameless-even-about-illegality-1256243779821"}, {"title": "Betsy Devos won’t examine the role of guns in school violence", "text": "Betsy Devos won’t examine the role of guns in school violence copied!\n\nAfter the deadly mass shooting at a Parkland high school that killed 17 people, the government set up a commission on school safety. That commission will not be looking into the role guns play in school violence. Stephanie Ruhle and Ali Velshi have the details.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/betsy-devos-won-t-examine-the-role-of-guns-in-school-violence-1249592899980"}, {"title": "Parkland graduates announce next plan to stop gun violence", "text": "Parkland graduates announce next plan to stop gun violence copied!\n\nFour students were unable to graduate from Marjorie Stoneman Douglas High School after the mass shooting in February in Parkland, Florida. The students behind the March For Our Lives movement are creating something new to get people to the voting booths. Ali Velshi and Stephanie Ruhle speak with Stoneman Douglas senior Jaclyn Corin about the students’ mission.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/parkland-graduates-announce-next-plan-to-stop-gun-violence-1247951939926"}, {"title": "In secret recording, GOP candidate made candid comments about party primaries", "text": "In Georgia’s Republican gubernatorial primary in May, Lt. Gov. Casey Cagle (R) came out on top, but he fell short of the 50% threshold, and he still has to win a runoff to advance to the general election.\n\nThat’s proving to be a little more difficult than the lieutenant governor probably planned. Cagle had a candid private conversation with one of his rivals, Clay Tippins, two days after the initial primary, not realizing that their chat was being recorded. (Cagle was hoping to secure Tippins’ endorsement at the time.)\n\nAnd what a recording it is. We learned a month ago, for example, that Cagle admitted to Tippins that he deliberately supported “bad public policy” as part of a scheme to hurt a different rival candidate. Yesterday, a new revelation from the recording emerged, and this one may be even more politically damaging.\n\nCagle can be heard candidly discussing the GOP primary’s sharp turn to the right, saying the five-man race came down to “who had the biggest gun, who had the biggest truck and who could be the craziest.” […] “The issues you talk about are the issues I care about as well. The problem is in a primary – and you and I are just talking off the record, frank – they don’t give a (expletive) about those things, OK. In the general election, they care about it, OK. But they don’t care about it in a primary.” Cagle says in the newly released snippet.\n\nSecretary of State Brian Kemp, Cagle’s rival in the runoff primary, said in a statement to the Associated Press that the newly released recording “exposes Cagle’s real opinion of Republican voters in Georgia.”\n\nAll of which leads to a related question: is there anything else on that recording we should know about?\n\nThe NBC News report on this added, “Asked by the Associated Press whether the Kemp campaign has still more snippets it’s holding onto, Kemp spokesman, Ryan Mahoney, said: ‘We will continue to create a clear contrast between Kemp and Cagle in the weeks leading up to Election Day on July 24th.’”\n\nGeorgia Republicans will vote two weeks from today. Cagle has long been considered the frontrunner, but these latest developments probably aren’t doing his candidacy any favors.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/secret-recording-gop-candidate-made-candid-comments-about-party-primaries"}, {"title": "Following racial controversy, GOP gives up on NJ candidate", "text": "The first sign of trouble in New Jersey’s 2nd congressional district came two months ago. On the heels of Seth Grossman’s Republican primary victory, the public learned that the GOP nominee had delivered remarks in which he said, “The whole idea of diversity is a bunch of crap and un-American.”\n\nGrossman went on to describe concerns about diversity as “an excuse by Democrats, communists, and socialists, basically, to say that we’re not all created equal.”\n\nYesterday, the story got considerably worse when Media Matters highlighted the fact that the Republican congressional hopeful “previously touted opinion pieces that were published on two leading white nationalist websites.” One of those posts, which Grossman praised, claimed that Black people “are a threat to all who cross their paths.”\n\nRepublican officials had defended Grossman, but last night, as the Washington Post reported, they officially gave up.\n\nThe National Republican Congressional Committee has withdrawn its endorsement of a congressional candidate in New Jersey after reporters dug up offensive comments he’d made about black and Hispanic people. “Bigotry has no place in society – let alone the U.S. House of Representatives,” NRCC Chairman Steve Stivers said in a statement Monday night. “The NRCC withdraws our support of Seth Grossman and calls on him to reconsider his candidacy.”\n\nTo the extent that electoral considerations matter in a story like this, it’s probably worth emphasizing that New Jersey’s 2nd is seen by both parties as a key 2018 battleground. The district is currently represented by Republican Rep. Frank LoBiondo, who’s retiring, and with a partisan-voter-index rating of R+1, this should be among the nation’s most competitive contests.\n\nWhich makes it all the more significant that the National Republican Congressional Committee no longer feels it can support its own candidate.\n\nAt least as of this morning, Grossman remains the GOP nominee, and he’s given no indication that he’s open to quitting. That said, if his position were to change, it would fall to Republican officials in New Jersey to scramble to find a new candidate with four months remaining until Election Day.\n\nThe Democratic candidate in this race is state Sen. Jeff Van Drew, whom party leaders aggressively recruited for this race. As things stand, he’s now the clear favorite to win.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/following-racial-controversy-gop-gives-nj-candidate"}, {"title": "Trump’s Supreme Court pick could upend voting, LGBT, labor rights", "text": "Trump’s Supreme Court pick could upend voting, LGBT, labor rights copied!\n\nThe replacement of Justice Kennedy with a more consistently conservative Supreme Court justice could endanger LGBT rights, affirmative action, labor rights, and voting rights, among many other issues. Joy Reid and her panel also discuss if Donald Trump should be able to pick a Supreme Court justice during the Mueller probe.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/am-joy/watch/trump-s-supreme-court-pick-could-upend-voting-lgbt-labor-rights-1272221763532"}, {"title": "President Trump holds raucous rally in Montana", "text": "President Trump holds raucous rally in Montana copied!\n\nAt a campaign speech at a political rally, President Trump dissed the Justice Department, Hillary Clinton, and Senator Elizabeth Warren, lied about winning a state President Reagan couldn’t, and called Vladimir Putin “fine.” MSNBC Contributor Josh Barro and host of “The Gist” podcast, Mike Pesca join Chris Jansing to discuss the wild rally.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/president-trump-holds-raucous-rally-in-montana-1271438915646"}, {"title": "House GOP candidate questioned whether careers were women’s ‘healthiest pursuit’", "text": "One of the bigger upsets of the 2018 elections thus far came in North Carolina’s 9th congressional district, where incumbent Rep. Robert Pittenger lost in a Republican primary to a former pastor named Mark Harris. Right about now, some GOP officials probably wish that contest had gone the other way.\n\nClose video Women showing significant preference for Democrats in 2018: poll New Quinnipiac polling shows that women’s preference for Democrats in the 2018 midterm elections significantly surpasses that of previous years, without a corresponding boost in preference by men for Republicans. share tweet email save Embed\n\n“In our culture today, girls are taught from grade school that we tell them that what is most honorable in life is a career, and their ultimate goal in life is simply to be able to grow up and be independent of anyone or anything,” said Harris, then the senior pastor at First Baptist Church in Charlotte, adding, “But nobody has seemed to ask the question that I think is critically important to ask: Is that a healthy pursuit for society? Is that the healthiest pursuit for our homes? Is that the healthiest pursuit for our children? Is that the healthiest pursuit for the sexes in our generation?” […] In an earlier portion of Harris’ sermon, Harris tells parishioners that “only one title is given to a woman in all of scripture … the title given to a woman is ‘helper.’”\n\nABC News reported yesterday on a 2013 sermon Harris delivered on “God’s plan for biblical womanhood” and the modern difficulties for American women “to live out and fulfill God’s design.”\n\nIn the same remarks, Harry rejected the idea that women must be “barefoot and pregnant,” and said he believes women can excel in the workplace, but he added that women “must understand” their biblical “core calling.”\n\nThe then-pastor acknowledged at the time that his views may not be “politically correct in 2013.”\n\nOr, it turns out, in 2018.\n\nThe Republican candidate’s campaign this week made no real effort to walk back the sermon, clarifying in a multi-paragraph statement that by “core calling,” Harris meant that “there is no higher calling that a woman has than to be a helper to her husband and mother to her children.”\n\nNorth Carolina’s 9th hasn’t had a Democratic representative since the ’60s, but Democratic officials have high hopes for Marine Corps veteran and businessman Dan McCready, who’s set to take on Harris in November.\n\nI have a hunch those hopes are a little higher now.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/house-gop-candidate-questioned-whether-careers-were-womens-healthiest-pursuit"}, {"title": "Mueller is adding more prosecutors. What does it mean for Trump?", "text": "Mueller is adding more prosecutors. What does it mean for Trump? copied!\n\nThere's new reporting that Robert Mueller is expanding his investigative team as the special counsel investigation plows forward. What does it mean for Trump? Nancy Cook & Joyce Vance join to discuss.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/mueller-is-adding-more-prosecutors-what-does-it-mean-for-trump-1271187523717"}, {"title": "Elections since Trump suggest Democratic base energized for 2018", "text": "Elections since Trump suggest Democratic base energized for 2018 copied!\n\nRachel Maddow talks with Steve Kornacki about Democratic special election victories since the 2016 election, as well as significant shifts toward Democrats where Republicans managed to hold onto office, suggesting Democrats are energized for the midterm elections.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/elections-since-trump-suggest-democratic-base-energized-for-2018-1243515459866"}, {"title": "GOP departures a potentially ominous portent for Trump in 2018", "text": "GOP departures a potentially ominous portent for Trump in 2018 copied!\n\nRachel Maddow talks with Steve Kornacki about history's lessons for what to expect from midterm elections and whether 2018 is likely to follow a familiar pattern that Donald Trump won't like.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/gop-departures-a-potentially-ominous-portent-for-trump-in-2018-1243512387608"}, {"title": "Gwen Graham: The only woman in wide field for Florida Governor", "text": "Gwen Graham: The only woman in wide field for Florida Governor copied!\n\nThere’s a record number of women running in this year's midterms, and Florida is one of more than 20 states that has still never had a female governor. NBC’s Ali Vitali talks to the woman who's trying to change that this year: Gwen Graham, who says 2018 is the year of the woman.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/gwen-graham-the-only-woman-in-wide-field-for-florida-governor-1270155331619"}, {"title": "Senate panel contradicts Trump, says Russia hacked 2016 race", "text": "Senate panel contradicts Trump, says Russia hacked 2016 race copied!\n\nThe Senate Intelligence Committee announces it backs the U.S. intelligence community finding Russia did meddled in the 2016 election - with Putin's knowledge - and with a pro-Trump bias. Our panel reacts.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/senate-panel-contradicts-trump-says-russia-hacked-2016-race-1269903427525"}, {"title": "Trump 'solution' for separated families: 'come legally'", "text": "Trump 'solution' for separated families: 'come legally' copied!\n\nA federal judge extends the deadline for the Trump administration to reunite separated migrant families, while another judge rebukes the administration’s attempt to indefinitely detain them. Stephanie Ruhle breaks down what this means for the families who have yet to be reunited. Weighing in: Former Deputy Director of Speechwriting under President George W. Bush Peter Wehner, Editor-at-Large of Reason Magazine Matt Welch, and New York Times op-ed columnist Bret Stephens\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/trump-solution-for-separated-families-come-legally-1273790019833"}, {"title": "Abortion rights advocates see ominous choice in Kavanaugh", "text": "Abortion rights advocates see ominous choice in Kavanaugh copied!\n\nNancy Northup, president and CEO of the Center for Reproductive Rights, talks about Brett Kavanaugh's record on abortion access, Donald Trump's stated goal of choosing anti-abortion justices for the Supreme Court, and the need to protect abortion rights for women in the United States.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/kavanaugh-an-ominous-pick-for-advocates-of-abortion-rights-1273478211577"}, {"title": "Trump admin. won't meet child reunification deadline", "text": "Trump admin. won't meet child reunification deadline copied!\n\nThe Trump administration won't meet a Tuesday deadline to reunite all separated immigrant children under five with their parents.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/all-in/watch/trump-admin-won-t-meet-child-reunification-deadline-1273437763755"}, {"title": "Judge extends deadline as U.S. struggles to reunify migrant families", "text": "Judge extends deadline as U.S. struggles to reunify migrant families copied!\n\nA federal judge has agreed to extend Tuesday's deadline for the government to reunite 102 migrant children under the age of 5 who were separated from their parents under President Donald Trump's \"zero tolerance\" policy.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/hardball/watch/judge-extends-deadline-as-u-s-struggles-to-reunify-migrant-families-1273398851723"}, {"title": "Migrant kids defend themselves in court as reunification deadline looms", "text": "Migrant kids defend themselves in court as reunification deadline looms copied!\n\nStephanie Ruhle and Ali Velshi follow reports about children and babies left to fend for themselves in immigration court. The president of Kids in Need of Defense, Wendy Young, joins them to discuss what this process is like for such young children.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/migrant-kids-defend-themselves-in-court-as-reunification-deadline-looms-1273077315811"}, {"title": "Pruitt confronted in restaurant; aides offer new details", "text": "Pruitt confronted in restaurant; aides offer new details copied!\n\nEPA head Scott Pruitt appears to be the latest Trump official to be confronted in public about his record. While at a restaurant, a mother in Washington D.C. urged him to resign. Pruitt aides have also offered new details about his management.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/pruitt-confronted-in-restaurant-aides-offer-new-details-1269305411508"}, {"title": "Events around the world scheduled to help clean up the oceans", "text": "Events around the world scheduled to help clean up the oceans copied!\n\nAccording to The World Economic Forum, by 2050 there could be more plastics in the ocean than fish. World Oceans Day is a chance to bring attention to cleanup efforts around the world.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/events-around-the-world-scheduled-to-help-clean-up-the-oceans-1251349571812"}, {"title": "Pruitt’s EPA forges partnerships with climate deniers", "text": "About halfway through Barack Obama’s presidency, Republicans thought they’d stumbled across an important controversy. The Environmental Protection Agency, evidently, was in routine contact with private non-profit groups that advocate in support of the environment.\n\nSens. David Vitter (R-La.) and James Inhofe (R-Okla.) were quite aggressive on this in 2013, demanding that the EPA produce detailed records on the agency’s relationships with environmental groups.\n\n“It is important for Congress to understand the relationship between EPA and nongovernmental organizations, particularly as it relates to the coordination and influence over public policymaking,” the Republicans told the EPA at the time. They added, “[R]eleasing the correspondence between the EPA and these entitles is in the public interest.”\n\nIt was difficult to take the story seriously – there was never any evidence to suggest nefarious schemes or plot between the EPA and groups like the Sierra Club – but the story came to mind overnight after seeing this new report from the Associated Press.\n\nNewly released emails show senior Environmental Protection Agency officials working closely with a conservative group that dismisses climate change to rally like-minded people for public hearings on science and global warming, counter negative news coverage and tout Administrator Scott Pruitt’s stewardship of the agency. John Konkus, EPA’s deputy associate administrator for public affairs, repeatedly reached out to senior staffers at the Heartland Institute, according to the emails. “If you send a list, we will make sure an invitation is sent,” Konkus wrote to then-Heartland president Joseph Bast in May 2017, seeking suggestions on scientists and economists the EPA could invite to an annual EPA public hearing on the agency’s science standards. Follow-up emails show Konkus and the Heartland Institute mustering scores of potential invitees known for rejecting scientific warnings of man-made climate-change, including from groups like Plants Need CO2, The Right Climate Stuff, and Junk Science.\n\nThe emails were obtained by the Environmental Defense Fund and the Southern Environmental Law Center, which sued to enforce a Freedom of Information request.\n\nAnd while the revelations are unsettling, they’re not surprising. Donald Trump’s team at the EPA is overtly hostile to the agency’s goals and all kinds of environmental safeguards, so it stands to reason Scott Pruitt and his lieutenants would forge close ties to climate deniers and others on the far-right who work on environmental issues.\n\nBut five years ago, when it was Obama’s EPA communicating regularly with environmental advocacy groups, the Republican-led Senate Environment and Public Works Committee considered this highly controversial and worthy of close scrutiny. The panel’s GOP leaders expected detailed information, not only on the correspondence between the EPA and outside organizations, but also on what role those groups may have had in shaping policy.\n\nSo, any chance that same committee will show a similar interest now?", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/pruitts-epa-forges-partnerships-climate-deniers"}, {"title": "Kids head to court to fight climate change", "text": "Kids head to court to fight climate change copied!\n\nMSNBC’s Tammy Leitner talks to the kids suing federal government seeking to end the use of fossil fuels that contribute to global warming. These 21 kids from across America are going to the courts to fight climate change and make a true difference for the future.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/kids-head-to-court-to-fight-climate-change-1243356739708"}, {"title": "GOP member of Science Committee blames falling rocks for sea-level rise", "text": "Rep. Mo Brooks (R-Ala.) has developed an unfortunate reputation for saying all kinds of bizarre things, but this week’s addition to his greatest-hits list is a doozy.\n\nThe House Science Committee held a hearing on Wednesday to discuss technology’s role in addressing climate change, and the Alabama Republican took the opportunity to share an idea about sea-level rise with Philip Duffy, president of Woods Hole Research Center, who was one of the witnesses participating in the hearing. USA Today noted Brooks’ creative new idea:\n\n“Every single year that we’re on Earth, you have huge tons of silt deposited by the Mississippi River, by the Amazon River, by the Nile, by every major river system — and for that matter, creek, all the way down to the smallest systems,” Brooks said. “And every time you have that soil or rock whatever it is that is deposited into the seas, that forces the sea levels to rise. Because now you’ve got less space in those oceans because the bottom is moving up.” Brooks pointed to the White Cliffs of Dover and to California “where you have the waves crashing against the shorelines” and “you have the cliffs crash into the sea.” “All of that displaces the water which forces it to rise, does it not?” Brooks asked. “I’m pretty sure that on human time scales, those are minuscule effects,” Duffy answered.\n\nI imagine climate deniers may appreciate Brooks’ child-like logic: if a swimming pool, for example, were half filled with water, the water level would rise with the addition of many rocks. Maybe the congressman has even heard something about Archimedes.\n\nThe trouble, which the poor congressman doesn’t seem to appreciate, is the size of the planet’s swimming pool: a Washington Post analysis found that to explain the current rises, we’d have to take “the top five inches of every one of the United States’ 9.1 million square miles of land area and use it to coat the bottom of the world’s oceans” – and we’d have to do that every year.\n\nBut as embarrassing as Mo Brooks’ confusion is, there may be a way to put an encouraging spin on this.\n\nSure, it’s frustrating that an elected member of the House Science Committee presented a ridiculous argument during a hearing on a global crisis. And yes, ideally Brooks would have some rudimentary understanding of why his comments were so foolish.\n\nBut in recent years, far-right Republicans have gone out of their way to argue that the seas aren’t rising. A few years ago, for example, Republican state lawmakers in Virginia commissioned a study on climate change and the state’s Eastern shore, but they required that references to “sea-level rise” be omitted. (The GOP sponsor of the study pointed to “sea-level rise” as an example of “liberal code words.”) The same year, Republicans in North Carolina tried to prohibit a state-appointed science panel from relying on the scientific evidence related to sea levels.\n\nWith this in mind, I’m half-tempted to see Brooks’ nonsense as a tiny step in the right direction – because the Alabama congressman was at least willing to acknowledge the existence of the underlying issue.\n\nIf given a choice, I’d much prefer a discussion about why the oceans are rising to a discussion about whether the oceans are rising.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/gop-member-science-committee-blames-falling-rocks-sea-level-rise"}, {"title": "Ozone-destroying chemical emissions found in the Antarctic", "text": "Ozone-destroying chemical emissions found in the Antarctic copied!\n\nAurora Australis lights up the Antarctic, but there's something going on there that has scientists worried. A banned chemical called CFC 11 -- that eats away at Earth's protective ozone layer -- is being made. The problem? No one has a clue who's doing it, or where. Photograph courtesy of Patrick Cullis, for NOAA via the AP.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/hallie-jackson/watch/ozone-destroying-chemical-emissions-found-in-the-antarctic-1236111939868"}, {"title": "White House, EPA thwart release of pollution study", "text": "White House, EPA thwart release of pollution study copied!\n\nThe Trump administration is going to war with itself after the White House warned of a \"public relations nightmare\" if a federal study about contaminated water supplies is released.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/all-in/watch/white-house-epa-thwart-release-of-pollution-study-1234691651886"}, {"title": "Democratic strategist: WH doesn’t have proper vetting process", "text": "Democratic strategist: WH doesn’t have proper vetting process copied!\n\nVarious members of President Trump’s cabinet faced a great deal of scrutiny this week. Ronny Jackson’s nomination for secretary of Veterans Affairs failed, EPA Administrator Scott Pruitt testified on his ethics concerns, and Secretary of State Mike Pompeo narrowly received a favorable mark from a Senate committee. MSNBC Anchor Aaron Gilchrist and his panel speculates why the nominations process has proven to be so difficult for this administration.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/msnbc/watch/democratic-strategist-wh-doesn-t-have-proper-vetting-process-1221610563781"}, {"title": "Are Scott Pruitt's days at the EPA numbered?", "text": "Are Scott Pruitt's days at the EPA numbered? copied!\n\nThe White House is remaining tight lipped about the future of embattled EPA chief Scott Pruitt as new report suggests support for him in the administration may be waning.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/are-scott-pruitt-s-days-at-the-epa-numbered-1217817667585"}, {"title": "Jacob Soboroff joins NASA on a trip to Greenland", "text": "Will we begin to fear the ocean? 07:35", "authors": [], "url": "http://www.msnbc.com/all-in/watch/jacob-soboroff-joins-nasa-on-a-trip-to-greenland-1216019011758"}, {"title": "'No-poach' rules at fast food chains being investigated", "text": "'No-poach' rules at fast food chains being investigated copied!\n\nThere’s a new investigation into whether major fast-food chains are making pacts with franchise owners that hold down wages and limit employee advancement. Ali Velshi and Stephanie Ruhle explain.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/-no-poach-rules-at-fast-food-chains-being-investigated-1273953347674"}, {"title": "Firefighters save man from heart attack then finish his yardwork", "text": "Firefighters save man from heart attack then finish his yardwork copied!\n\nAfter a group of firefighters responded to a call for a heart attack, they went above and beyond the call of duty. They took the homeowner to the hospital before he could finish his yardwork, so they returned to finish it for him. That #GoodNewsRUHLES.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/firefighters-save-man-from-heart-attack-then-finish-his-yardwork-1273794627593"}, {"title": "Trump administration faces new allegations of ACA sabotage", "text": "Last fall, during his confirmation hearing, Alex Azar, Donald Trump’s choice to lead the Department of Health and Human Services, said he hadn’t seen “any effort to sabotage” the Affordable Care Act. Perhaps he ought to take another look.\n\nThe president and his team have taken several steps to undermine the existing U.S. health care system, and American consumers are already feeling the consequences of those actions in the form of costlier coverage.\n\nIt would be a mistake, however, to assume that the Republican administration is done. The Washington Post reported over the weekend:\n\nThe Trump administration took another major swipe at the Affordable Care Act, halting billions of dollars in annual payments required under the law to even out the cost to insurers whose customers need expensive medical services. In a rare Saturday afternoon announcement, the Centers for Medicare and Medicaid Services said it will stop collecting and paying out money under the ACA’s “risk adjustment” program, drawing swift protest from the health insurance industry.\n\nA Blue Cross and Blue Shield Association spokesperson, for example, told the New York Times, “Any action to stop disbursements under the risk adjustment program will significantly increase 2019 premiums for millions of individuals and small-business owners, and could result in far fewer health plan choices. It will undermine Americans’ access to affordable care, particularly for those who need medical care the most.”\n\nThis may seem like a fairly obscure part of the health care debate, so let’s unpack it a bit.\n\nWhen it comes to the market for individuals and small businesses, the Affordable Care Act built in some “shock absorbers,” intended to help stabilize insurance pools. This includes risk-adjustment policies, which are designed to lessen the blow among private insurers that end up with too many high-cost consumers.\n\nAs Jonathan Cohn explained yesterday, when risk-adjustment policies work properly, “the insurers with the healthy customers basically send money over to the ones with the sicker customers. When the schemes do not work properly – or, in this instance, if the insurers don’t get money they are expecting – then insurers that have enrolled sicker beneficiaries can end up with big losses, just as those with healthier beneficiaries could reap windfalls.”\n\nAccording to the Trump administration, a federal court in New Mexico recently ruled that the existing risk-adjustment system is flawed, so the Department of Health and Human Services effectively had no choice but to stop the payments to private insurers.\n\nExcept, that’s a highly debatable posture. Ordinarily, an administration would explore a variety of alternatives – including applying changes exclusively to New Mexico – before making a dramatic national move like this. The fact that Team Trump took this step suggests to the White House’s critics that the administration may be exploiting a district court ruling to advance a political agenda against “Obamacare.”\n\nIn fairness, it’s worth emphasizing that HHS has described the move as temporary and asked the court to reconsider its preliminary ruling.\n\nBut in the meantime, the fight has added additional uncertainty to the market, and no one seems able to say with confidence when (or how) this will be resolved.\n\nAnd the longer this continues, the more likely it is insurers will raise premiums or even consider withdrawing from markets.\n\nThe Trump administration was already facing credible accusations of making the system worse on purpose. Those claims are poised to get a little louder.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/trump-administration-faces-new-allegations-aca-sabotage"}, {"title": "Two more people poisoned by nerve agent in the UK", "text": "Two more people poisoned by nerve agent in the UK copied!\n\nTwo more people have been poisoned by the nerve agent Novichok, which almost killed a former Russian spy and his daughter in an attack in March. Ali Velshi breaks down what the chemical weapon actually is.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/two-more-people-poisoned-by-nerve-agent-in-the-uk-1270752835599"}, {"title": "Eric Bolling heads out on July 4 bus tour", "text": "Eric Bolling heads out on July 4 bus tour copied!\n\nHost and author Eric Bolling is headed out on a bus tour starting on July 4 to launch his new show 'America'. Bolling joins Morning Joe to discuss the tour, the country's opioid crisis, Scott Pruitt, tariffs and Betsy DeVos.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/eric-bolling-heads-out-on-july-4-bus-tour-1269308483881"}, {"title": "Federal court rejects GOP governor’s Medicaid work requirements", "text": "For several years, Kentucky was so effective in implementing the Affordable Care Act, the Bluegrass State became a national model in health care governance. Then voters replaced Gov. Steve Beshear (D) with Matt Bevin (R) – and the latter got to work undoing what had been done.\n\nNot only was Kentucky’s exchange marketplace scrapped, but the new Republican administration sought new ways to place restrictions on Medicaid beneficiaries, which the Trump administration endorsed.\n\nA federal court, however, reached a different conclusion. The Lexington Herald-Leader reports:\n\nThe ruling blocks Gov. Matt Bevin’s administration from implementing the change, which was scheduled to start Monday in one Northern Kentucky county and extend to most of the rest of the state by the end of the year. Sixteen Kentucky Medicaid recipients sued the federal government in January to block Bevin’s planned changes to the state’s Medicaid program. The plaintiffs claim that Bevin’s plan – known as Kentucky HEALTH – should not have been approved; they say it violates the 1965 law establishing Medicaid because it will reduce poor people’s access to health care.\n\nThe full ruling is online here (pdf). Judge James Boasberg clearly wasn’t impressed with the defense’s arguments.\n\n“Although the secretary is afforded significant deference in his approval of pilot projects like Kentucky’s, his discretion does not insulate him entirely from judicial review. Such review reveals that the secretary never adequately considered whether Kentucky HEALTH would in fact help the state furnish medical assistance to its citizens, a central objective of Medicaid,” Boasberg wrote. “This signal omission renders his determination arbitrary and capricious. The Court, consequently, will vacate the approval of Kentucky’s project and remand the matter to HHS for further review.”\n\nSo, now what?\n\nIn Kentucky, Matt Bevin basically announced an ultimatum: if he couldn’t impose work requirements on Medicaid beneficiaries, he’d scrap Medicaid expansion in the state altogether, stripping hundreds of thousands of his own constituents of their health care benefits.\n\nIt’s hard to say whether the first-term governor was bluffing, and it’ll take a while before we find out: Bevin’s administration will appeal today’s decision and the Republican won’t follow through on his threat until the legal options have been exhausted.\n\nKentucky is trying to become the nation’s state to impose these requirements, and as Jeffrey Young explained, this gives the controversy added national weight:\n\nMore than 60 percent of adults with Medicaid already work. Most of the remainder would fail under exemptions to the proposed work requirements because, for example, they’re “medically frail” or serve as a full-time caregiver to children. Kids, pregnant women, the elderly and people with disabilities are completely exempt from the work requirements. Under the plans approved for Kentucky and other states, however, nearly all working-age adults without disabilities would still have to prove they’re working or meeting the alternate requirements for 80 hours a month. This bureaucratic hurdle would create significant new costs for states and serious burdens for the low-income people who use Medicaid, who would be at risk of losing coverage if they failed to report their work hours to the states. If work requirements were in force nationwide, as many as 4 million people would lose Medicaid coverage, the Kaiser Family Foundation projects.\n\nToday’s ruling means the national regressive push has been halted, at least for now.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/federal-court-rejects-gop-governors-medicaid-work-requirements"}, {"title": "Rising stakes stoke passions of community activists against Trump", "text": "Rising stakes stoke passions of community activists against Trump copied!\n\nEzra Levin, executive director of The Indivisible Project, talks with Rachel Maddow about how outrage over the Donald Trump administration's family separation policy at the border and the generational stakes of a new Supreme Court pick have inflamed an already energized national network of grassroots activists.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/rising-stakes-stoke-passions-of-community-activists-against-trump-1266608707761"}, {"title": "Migrant children in detention facilities are ‘not doing well’", "text": "Migrant children in detention facilities are ‘not doing well’ copied!\n\nMSNBC obtained the first video from inside a facility housing children separated from their parents that was not distributed by the government. Ali Velshi discusses this new video and the health effects of children being separated from their parents. Weighing in: MSNBC Correspondent Mariana Atencio, Director of Child Psychiatry at Bellevue Hospital Dr. Jennifer Havens, and Dr. Jamie Howard, a clinical psychologist at the Child Mind Institute.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/migrant-children-in-detention-facilities-are-not-doing-well-1264340547834"}, {"title": "Trump boasts he’s ‘gutted’ the ACA, avoids blame for consequences", "text": "Donald Trump was in Nevada over the weekend, campaigning in support of Sen. Dean Heller (R), and reflected on the vote Sen. John McCain (R-Ariz.) cast against the Republicans’ plan to repeal the Affordable Care Act. The president told supporters:\n\n“It’s all right, because we’ve essentially gutted it anyway.”\n\nSeven seconds later, Trump added:\n\n“Just remember, if you see [premiums going up], it is the Democrats’ fault.”\n\nThe president’s supporters cheered with approval, seemingly oblivious to the rhetorical whiplash. Trump is absolutely certain that, in his words, he’s “essentially gutted” the backbone of his own country’s health care system, and he’s equally certain that the consequences of his actions should be blamed on the one group of people who have no control over the levers of federal power.\n\nThere’s no reason for any sensible person to take this seriously, but it is worth understanding why Trump seems a little defensive on the issue.\n\nTwo big insurers in Texas requested significant premium increases last week, and both said the price hikes were the direct result of Republican policies. As we discussed a few weeks ago, Texas is hardly alone: insurers in states across the country have been submitting rate hikes to regulators, and they’re all saying the same thing: Republican changes to the Affordable Care Act, spearheaded by Donald Trump, have undermined the American market to the detriment of consumers.\n\nReporting on the latest data from the Congressional Budget Office, Axios recently added, “Insurance premiums tend to go up every year, but the magnitude of these increases stems largely from the repeal of the ACA’s individual mandate, the expansion of skimpy short-term plans, and the decision last year to cut off the law’s cost-sharing payments.”\n\nWhen the president took these actions, quite a few of us said his moves would make things worse. The bill is now due – though it’s not Trump who’ll pay more, it’s the consumers he chose to punish out of political spite.\n\nEven former Health and Human Services Secretary Tom Price, a former far-right congressman from Trump’s own cabinet, recently conceded that his party’s efforts “drive up the costs” for many consumers.\n\nWhether the president realizes this or not, lying to those same consumers, telling them to blame Democrats for his actions, only makes this worse.\n\nIt’s not exactly a secret that Trump has struggled to understand the basics of the health care debate, but on Saturday in Nevada, the president very nearly packaged things in a way even he could understand: the White House “essentially gutted” the system, and as a result, Americans are now paying more.\n\nIf Trump has a coherent explanation as to why this is Democrats’ fault, I’m eager to hear it.", "authors": [], "url": "http://www.msnbc.com/rachel-maddow-show/trump-boasts-hes-gutted-the-aca-avoids-blame-consequences"}, {"title": "U.S. Army Corporal who died shielding his team from blast", "text": "U.S. Army Corporal who died shielding his team from blast copied!\n\nStephanie Ruhle and Ali Velshi honor U.S. Army Corporal Joseph Maciel who lost his life shielding his colleagues from a blast in Afghanistan. The incident is under investigation, but the Defense Department is calling it an insider attack.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/u-s-army-corporal-who-died-shielding-his-team-from-blast-1273954371523"}, {"title": "Trump to meet Putin on July 16 in Helsinki", "text": "Trump to meet Putin on July 16 in Helsinki copied!\n\nDonald Trump will meet Vladimir Putin on July 16 in Helsinki. Joy Reid and her panel discuss why the American president has apparently been bashing NATO and other U.S. allies typically hostile to Putin.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/am-joy/watch/trump-to-meet-putin-on-july-16-in-helsinki-1272216131813"}, {"title": "U.S. discharging immigrant military recruits without explanation", "text": "U.S. discharging immigrant military recruits without explanation copied!\n\nMargaret Stock, immigration attorney, talks about the U.S. military's sudden discharge of immigrant military enlistees with vague explanations of failed background checks.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/rachel-maddow/watch/u-s-discharging-immigrant-military-recruits-without-explanation-1271957571916"}, {"title": "Trump administration kicks out immigrants serving in the army", "text": "Trump administration kicks out immigrants serving in the army copied!\n\nThe Trump administration is reportedly kicking out some immigrants in the U.S. Army after promising them a path to citizenship. Ali Velshi is joined by the founder and director of the Deported Veterans Support House, Hector Barajas, to discuss what this means for these immigrants.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/trump-administration-kicks-out-immigrants-serving-in-the-army-1271562307722"}, {"title": "The 700 immigrants awarded Medal of Honor are #MonumentalAmericans", "text": "The 700 immigrants awarded Medal of Honor are #MonumentalAmericans copied!\n\nToday, Ali Velshi honors the 700 immigrants who have received the nation’s highest award for valor during military action going all the way back to the Civil War.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/the-700-immigrants-awarded-medal-of-honor-are-monumentalamericans-1271554115847"}, {"title": "AP: Army discharging immigrants with promised path to citizenship", "text": "AP: Army discharging immigrants with promised path to citizenship copied!\n\nAccording to the Associated Press, the Army is discharging immigrants who were promised a path to citizenship. Chris Jansing is joined by Defense One executive editor Kevin Baron, Business Insider senior editor Josh Barro, and host of “The Gist” Mike Pesca to discuss that and a stunning new revelation that there are nearly 3,000 migrant children still separated from their parents.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/ap-army-discharging-immigrants-with-promised-path-to-citizenship-1271447107750"}, {"title": "ICE has turned into 'runaway train,' says congressman", "text": "ICE has turned into 'runaway train,' says congressman copied!\n\nRep. Adriano Espaillat, D-NY, discusses the Trump administration's border policy and the impact it has on families entering the U.S., including the challenges of reuniting families after separation. Rep. Espaillat also says that ICE has become a 'runaway train.'\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/ice-has-turned-into-runaway-train-says-congressman-1271425091683"}, {"title": "The impact of Trump's NATO rhetoric", "text": "Schumer: Kavanaugh is far, far right on so many issues 08:43", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/the-impact-of-trump-s-nato-rhetoric-1271414339563"}, {"title": "Scramble to reunite families as deadline looms", "text": "Scramble to reunite families as deadline looms copied!\n\nThe panel discusses new reporting on the impacts of family separation at the U.S. border as a deadline looms for the government to reunite families separated at the border.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/scramble-to-reunite-families-as-deadline-looms-1271365187761"}, {"title": "Kavanaugh raises no immediate concerns: GOP senator", "text": "Kavanaugh raises no immediate concerns: GOP senator copied!\n\nSen. James Lankford, R-Okla., discusses his support for Brett Kavanaugh, the president's nominee for the Supreme Court. Sen. Lankford also weighs in on the president's upcoming meeting with Vladimir Putin and the U.S.-Mexico border crisis.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/kavanaugh-raises-no-immediate-concerns-gop-senator-1273723971927"}, {"title": "Kavanaugh is a 'serious, conservative judge': Law scholar", "text": "Kavanaugh is a 'serious, conservative judge': Law scholar copied!\n\nThe Morning Joe panel -- including Nina Totenberg and Benjamin Wittes -- discuss the impact Brett Kavanaugh could have on the Supreme Court.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/kavanaugh-is-a-serious-conservative-judge-law-scholar-1273699907562"}, {"title": "What Brett Kavanaugh brings to the table", "text": "What Brett Kavanaugh brings to the table copied!\n\nPresident Trump on Monday nominated Brett Kavanaugh, a federal appeals court judge in Washington, to succeed Justice Anthony Kennedy on the Supreme Court. The panel breaks down Kavanaugh's record.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/what-brett-kavanaugh-brings-to-the-table-1273663043929"}, {"title": "NYT: Trump called his own staff 'stupid' during call with Putin", "text": "NYT: Trump called his own staff 'stupid' during call with Putin copied!\n\nA New York Times report states that in March while on the phone with Putin, Pres. Trump referred to his own staff as 'stupid people' telling Putin 'you shouldn't listen to them.' Michael Schmidt of The New York Times reacts.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/nyt-trump-called-his-own-staff-stupid-during-call-with-putin-1273517635763"}, {"title": "What we know about Trump's Supreme Court nominee Brett Kavanaugh", "text": "What we know about Trump's Supreme Court nominee Brett Kavanaugh copied!\n\nPres. Trump has picked federal appeals court judge Brett Kavanaugh for the Supreme Court. If confirmed, the 53-year-old jurist would make the high court solidly conservative. Robert Costa, Kimberly Atkins, & Tom Goldstein all join.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/what-we-know-about-trump-s-supreme-court-nominee-brett-kavanaugh-1273505347839"}, {"title": "Did Trump factor in Mueller's probe when making his SCOTUS pick?", "text": "Did Trump factor in Mueller's probe when making his SCOTUS pick? copied!\n\nDid the Mueller investigation factor into Trump's decision to pick federal appeals court judge Brett Kavanaugh for the Supreme Court? We talk to veteran DC attorney Tom Goldstein of SCOTUS Blog.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/brian-williams/watch/did-trump-factor-in-mueller-s-probe-when-making-his-scotus-pick-1273505347704"}, {"title": "Judge Kavanaugh on gun control, EPA, net neutrality", "text": "Judge Kavanaugh on gun control, EPA, net neutrality copied!\n\nAs Judge Brett Kavanaugh nears his confirmation hearing, Ali Velshi and Stephanie Ruhle break down his stances on the key issues of gun control, EPA regulations, net neutrality and gerrymandering. Weighing in: The President of the Laywers’ Committee for Civil Rights Under Law, Kristen Clarke\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/judge-kavanaugh-on-gun-control-epa-net-neutrality-1273945667623"}, {"title": "Dramatic rescue underway for trapped Thai soccer team", "text": "Dramatic rescue underway for trapped Thai soccer team copied!\n\nA dramatic rescue is underway to free the remaining children trapped in that flooded cave in Thailand. Stephanie Ruhle and Ali Velshi speak with NBC Correspondents Bill Neely and Matt Bradley and the Director of the National Center for Disaster Preparedness at Columbia University, Dr. Irwin Redlener about this race against the clock.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/velshi-ruhle/watch/dramatic-rescue-underway-for-trapped-thai-soccer-team-1273074243629"}, {"title": "GoodNewsRUHLES: Starbucks to phase out all plastic straws by 2020", "text": "GoodNewsRUHLES: Starbucks to phase out all plastic straws by 2020 copied!\n\nStarbucks announced today that the coffee giant plans to scrap all plastic straws worldwide and replace them with recyclable lids and non-plastic straws by 2020. #GoodNewsRuhles\n\nRead More", "authors": [], "url": "http://www.msnbc.com/stephanie-ruhle/watch/goodnewsruhles-starbucks-to-phase-out-all-plastic-straws-by-2020-1273013827765"}, {"title": "Beyonce, Jay-Z set to headline Global Citizen Festival: Mandela 100", "text": "Beyonce, Jay-Z set to headline Global Citizen Festival: Mandela 100 copied!\n\nThe Global Citizen Festival announces its Mandela 100 concert to honor Nelson Mandela's legacy in the fight to end extreme poverty. The festival will be headlined by Beyonce, Jay-Z and more. Forest Whitaker, Rev. Al Sharpton and Chuck Robbins discuss.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/morning-joe/watch/beyonce-jay-z-set-to-headline-global-citizen-festival-mandela-100-1272961603708"}, {"title": "Ex-president of Fox Bill Shine joins Trump White House as communications director", "text": "Ex-president of Fox Bill Shine joins Trump White House as communications director copied!\n\nThe former president of Fox News Bill Shine is joining Donald Trump’s White House as the communications director; meanwhile, tweets by Shine’s wife have emerged containing controversial content. Joy Reid and her panel discuss the apparently close ties between the White House and Fox News.\n\nRead More", "authors": [], "url": "http://www.msnbc.com/am-joy/watch/ex-president-of-fox-bill-shine-joins-trump-white-house-as-communications-director-1272582211761"}]